package com.bss.bishnoi;

import static android.content.ContentValues.TAG;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.annotation.SuppressLint;
import android.content.Context;
import android.content.Intent;
import android.os.Bundle;
import android.os.Handler;
import android.util.Log;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.view.animation.Animation;
import android.view.animation.AnimationUtils;
import android.widget.ImageView;
import android.widget.RelativeLayout;
import android.widget.ScrollView;
import android.widget.TextView;

import com.bss.bishnoi.adapters.ShabadAdapter;
import com.bss.bishnoi.interfaces.OnItemClickListener;
import com.google.android.ads.nativetemplates.NativeTemplateStyle;
import com.google.android.ads.nativetemplates.TemplateView;
import com.google.android.gms.ads.AdError;
import com.google.android.gms.ads.AdLoader;
import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.FullScreenContentCallback;
import com.google.android.gms.ads.LoadAdError;
import com.google.android.gms.ads.interstitial.InterstitialAd;
import com.google.android.gms.ads.interstitial.InterstitialAdLoadCallback;
import com.google.android.gms.ads.nativead.NativeAd;
import com.google.firebase.auth.FirebaseAuth;
import com.google.firebase.auth.FirebaseUser;
import com.google.firebase.database.DataSnapshot;
import com.google.firebase.database.DatabaseError;
import com.google.firebase.database.DatabaseReference;
import com.google.firebase.database.FirebaseDatabase;
import com.google.firebase.database.ValueEventListener;
import com.google.firebase.firestore.CollectionReference;
import com.google.firebase.firestore.FirebaseFirestore;

public class Shabadwani extends AppCompatActivity implements OnItemClickListener {

    String uPhone, fProfileUrl;
    RecyclerView recyclerView;
    ShabadAdapter shabadAdapter;

    FirebaseFirestore firebaseFirestore;
    CollectionReference usersRef;
    FirebaseAuth firebaseAuth;
    FirebaseUser currentUser;
    ImageView arrow_back, arrow_forward;

    TextView textShabadDescription, home;

    RelativeLayout layout_recycler, layout_description, layout_shabad_description;
    ScrollView scrollView;

    TextView titleView;
    ImageView btnBack;
    ImageView btnList;

    // For interstitial Ad
    private InterstitialAd mInterstitialAd;
    private Handler mHandler = new Handler();
    private Runnable mRunnable;
    private Context mContext;

    Boolean shabadwaniIAd = false;
    Boolean shabadwaniNAd = false;
    
    public String[] shabads = {
            "शब्द 1",
            "शब्द 2",
            "शब्द 3",
            "शब्द 4",
            "शब्द 5",
            "शब्द 6",
            "शब्द 7",
            "शब्द 8",
            "शब्द 9",
            "शब्द 10",
            "शब्द 11",
            "शब्द 12",
            "शब्द 13",
            "शब्द 14",
            "शब्द 15",
            "शब्द 16",
            "शब्द 17",
            "शब्द 18",
            "शब्द 19",
            "शब्द 20",
            "शब्द 21",
            "शब्द 22",
            "शब्द 23",
            "शब्द 24",
            "शब्द 25",
            "शब्द 26",
            "शब्द 27",
            "शब्द 28",
            "शब्द 29",
            "शब्द 30",
            "शब्द 31",
            "शब्द 32",
            "शब्द 33",
            "शब्द 34",
            "शब्द 35",
            "शब्द 36",
            "शब्द 37",
            "शब्द 38",
            "शब्द 39",
            "शब्द 40",
            "शब्द 41",
            "शब्द 42",
            "शब्द 43",
            "शब्द 44",
            "शब्द 45",
            "शब्द 46",
            "शब्द 47",
            "शब्द 48",
            "शब्द 49",
            "शब्द 50",
            "शब्द 51",
            "शब्द 52",
            "शब्द 53",
            "शब्द 54",
            "शब्द 55",
            "शब्द 56",
            "शब्द 57",
            "शब्द 58",
            "शब्द 59",
            "शब्द 60",
            "शब्द 61",
            "शब्द 62",
            "शब्द 63",
            "शब्द 64",
            "शब्द 65",
            "शब्द 66",
            "शब्द 67",
            "शब्द 68",
            "शब्द 69",
            "शब्द 70",
            "शब्द 71",
            "शब्द 72",
            "शब्द 73",
            "शब्द 74",
            "शब्द 75",
            "शब्द 76",
            "शब्द 77",
            "शब्द 78",
            "शब्द 79",
            "शब्द 80",
            "शब्द 81",
            "शब्द 82",
            "शब्द 83",
            "शब्द 84",
            "शब्द 85",
            "शब्द 86",
            "शब्द 87",
            "शब्द 88",
            "शब्द 89",
            "शब्द 90",
            "शब्द 91",
            "शब्द 92",
            "शब्द 93",
            "शब्द 94",
            "शब्द 95",
            "शब्द 96",
            "शब्द 97",
            "शब्द 98",
            "शब्द 99",
            "शब्द 100",
            "शब्द 101",
            "शब्द 102",
            "शब्द 103",
            "शब्द 104",
            "शब्द 105",
            "शब्द 106",
            "शब्द 107",
            "शब्द 108",
            "शब्द 109",
            "शब्द 110",
            "शब्द 111",
            "शब्द 112",
            "शब्द 113",
            "शब्द 114",
            "शब्द 115",
            "शब्द 116",
            "शब्द 117",
            "शब्द 118",
            "शब्द 119",
            "शब्द 120"
    };

    public String[] shabadDescription = {
            "ओ३म् गुरु चीन्हों गुरु चीन्ह पुरोहित।\nगुरु मुख धर्म बखाणीं।।\nजो गुरु होयबा सहजे शीले सबदे \nनादे वेदे तिहिं गुरु का आलिंकार पिछाणी।।\nछव दरशण जिहिं के रूपण थापण,\nसंसार बरतण निज कर थरप्या।\nसो गुरु प्रत्यक्ष जाणी।।\nजिहिं कै खर तर गोठ निरोत्तर वाचा।\nरहिया रूद्र समाणी।\nगुरु आप संतोषी अवरां पोखी।\nतंत महारस बाणी।।\nके के अलिया बासण होत हुताशण।\nतामैं खीर दुहीजें।।\nरसूवन गोरस घीय ने लीयूं।\nतहां दूध न पाणी।।\nगुरु ध्याईये रे ज्ञानी तोड़त मोहा।\nअति खुरसाणी छीजत लोहा।\nपांणी छल तेरी खाल पखाला।\nसतगुरु तोड़े मन का साला।।\nसतगुरु है तो सहज पिछाणी।\nकृष्ण चरित बिन काचै करवै \nरह्यो न रहसी पाणी।।१।।",
            "ओ३म् मोरे छाया न माया लोही न माँसूँ।\nरक्तूँ न धातूँ, मोरे माई न बापूँ।।\nआपण आपू, रोही न रापूँ।\nकोपूँ न कलापूँ, दुःख न सरापूँ।।\nलोई अलोई।\nत्यँह तृलोई।\nऐसा न कोई जपां भी सोई।।\nजिहिं जपे आवागवण न होई।।\nमोरी आद न जाणत।\nमहीयल धूँवा बखाणत।।\nउरध ढाकले तृसूलूँ।\nआद अनाद तो हम रचीलो, हमे  सिरजीलो सै कोण।।\nम्हे जोगी कै भोगी कै  अल्प अहारी \nज्ञानी कै ध्यानी, कै निज कर्म धारी।।\nसोखी कै पोखी।\nकै जल बिंब धारी, \nदया धर्म थापले निज बाला ब्रह्मचारी ।।२।।",
            "ओ३म् मोरै अंग न अलसी तेल न मलियो।\nना परमल पीसायों।।\nजीमत पीवत भोगत बिलसत दीसां नाहीं।\nम्हापण को आधारूं।।\nअड़सठ तीरथ हिरदा भीतर।\nबाहर लोका चारूं।\nनान्हीं मोटी जीया जूँणी।\nएती सास फुरंतै सारूं।।\nबासंदर क्यूँ एक भणीजै।\nजिहिं कै पवन पिराणों।।\nआला सूका मेल्है नाहीं।\nिहिं दिश करै मुहाणों।।\nपापे गुन्हे वीहै नाहीं।\nरीस करै रीसाणों।।\nबहूली दौरे लावण हारूं।\nभावै जाण मैं जाणूं।।\nन तूं सुरनर, न तू शंकर।\nन तू राव न राणों।।\nकाचै पिंड अकाज चलावै महा अधूरत दाणों।\nमौरे छुरी न धारू लोह न सारूं हथियारूं।\nसूरज को रिप बिहंडा नाहीं, \nतातै कहां उठावत भारू।।\nजिहिं हाकणड़ी बलद जू हाकै \nन लोहै की आरूं।।३।।",
            "ओ३म् जद पवन न होता पाणी न होता।\nन होता धर  गणारूं।।\nचंद न होता सूर न होता।\nन होता गिगं दर तारूं।।\nगऊ न गोरू माया जाल न होता न होता हेत पियारूं।\nमाय न बाप न बहण न भाई साख न सैंण न होता।।\nन होता पख  परवारूं।।\nलख चौरासी जीया जूणी न होती।\nन होती वणीं अठारा भारू।।\nसप्त पताल फुंणीद न होता।\nन होता सागर खारूं।।\nअजिया सजिया जीया जूणी न होती।\nन होती कुड़ी भरतारूं  ।।\nअर्थ न गर्थ न गर्व न होता।\nन होता तेजी तुरंग तुखारूं  ।।\nहाट पटण बाजार न होता।\nन होता राज दवारूं  ।।\nचाव न चहन न कोह का बांण न होता।\nतद होता एक निरंजण शिंभू, कै होता धंधू कारूं  ।।\nबात कदो की पूछै लोई।\nजुग छत्तीस बिचारूं।।\nताह परैरे अवर छत्तीसूं।\nपहला अंत न पारूं।।\nम्हे तदपण होता अब पण आछै, बल-बल होयसां\nकह कद कद का करूं विचारूं।।४।।",
            "ओ३म् अइया लो अपरंपर बांणी।\nम्हे जपां न जाया जीऊ।।\nनव अवतार नमो नारायण।\nतेपण रूप हमारा थीयूं।।\nजती तपी तक पीर ऋषेष्वर।\nकांय जपीजै तेपण जाया जीऊ।।\nखेचर भूचर खेत्रपाला परगट गुप्ता।।\nकांय जपीजै तेपण जाया जीऊं।।\nवासग शेष गुणिंदा फुणिंदा।\nकांय जपीजै तेपण जाया जीऊं ।।\nचोषट जोगनि बावन बीरूं ।\nकांय जपीजै तेपण जाया जीऊ ।\nजप तो एक निरालंभ शिंभु ।\nजिहिं कै माई न पीऊं ।।\nन तन रक्तूँ न तन धातूं ।\nन तन ताव न सीऊँ ।\nसर्व सिरजत मरत बिवरजत ।\nतासन मूलज लेणा कीयों ।।\nअइयालों अपरंपर बाणी ।\nम्हे जपां न जाया जीऊ।।५।।",
            "ओ३म् भवन-भवन म्हे एकाजोती।\nचुन-चुन लीयारतना मोती।।\nम्हें खोजी थापण होजी नाहीं।\nखोज लहां धुर  खोजूँ।।\nअल्लाह अलेख अडाल अजोनि स्वयंभू।\nजिहि का किसा बिनाणी।।\nम्हे सरै न बैठा सीख न पूछी।\nनिरत सुरत  सब जाणी।।\nउतपति हिंदू जरणा जोगी।\nकिरिया ब्राह्मण दिल दरवेसां उन मुन मुल्ला अकल मिसलमानी।।६।।",
            "ओ३म् हिंदू होय कै हरि क्यूँ ना जंप्यो।\nकायं दहदिश पर पसरायों।।\nसोम अमावस आदितवारी।\nकाय काटी रायों।।\nगहण गहुँतै, बहण बहंतै।\nनिर्जल ग्यारस मूल बहंतै।\nकांयरे मुरखा तैं पालंग सेज निहाल बिछाई।।\nजा  दिन तेरे होम न जाप न तप न किरिया।\nजान के भागी कपिला गाई।।\nकूड़तणों जे करतब कीयो।\nनातैं लाव न सायों।।\nभूला प्राणी आल बखाणी।\nन जंप्यो सुर रायों।।\nछंदै कहां तो बहुता भावै।\nखरतर को पतियायों।\nहिव की बेलां  हिय न जाग्यो।\nशंक रह्यो कदरायों।।\nठाढी बेला ठार  न जाग्यो।\nताती बेलां तायों।।\nबिम्बै बेला विष्णु न जंप्यों।\nताछै का चीन्हों कछु कमायों।।\nअति आलस भोला वै भूला, न चीन्हो सुररायों।।\nपारब्रह्म की सुध न जाणी।\nतो नागे जोग न पायो।।\nपरशुराम के अर्थ न मूवा।\nताकीं निश्चै सरी न कायों।।७।।",
            "ओ३म् सुण रे काजी सुण रे मुल्लां।\nसुण रे बकर कसाई।।\nकिणरी थरपी छाली रोसो।\nकिणरी गाडर गाई।।\nसूल चुभीजै करक दुहेली।\nतो है है जायो जीव न घाई।।\nथे तुरकी छुरकी भिस्ती दावो।\nखायबा खाज अखाजूँ।।\nचर फिर आवै सहज दुहावै।\nतिसका खीर हलाली।\nजिसके गले करद क्यूं सारो।\nथे पढ सुण रहिया रहिया खाली ।।८।।",
            "ओ३म् दिल साबत हज काबो नेड़े।\nक्या उलबंग पुकारो।।\nभाई नाऊं बलद पियारो।\nताकै गलै करद क्यूं सारो।।\nबिन चीन्हैं खुदाय बिबरजत।\nकेहा मुसलमानो।।\nकाफर मुकर होयकर राह गुमायो।।\nजोय-जोय गाफल करे धिगाणों।।\nज्यू थे पच्छिम दिशा उलबंग पुकारो।\nभलजे यों चीन्हों रहमाणों।।\nतो रूह चलंतै पिण्ड पड़तै।\nआवै भिस्त बिमाणों।।\nचढ़-चढ़ भींते मड़ी मसीतें।\nक्या उलबंग पुकारो।।\nकांहे काजै गऊ बिणासो।\nतो करीम गऊ क्यूं चारी।।\nकाहीं लीयो दूधूं दहियूं।\nकाहीं लीयों घीयूँ महियें।।\nकाहीं लीयों हाडू मासूं।\nकाही लीययूं रक्तूं रूहियूं।।\nसुण रे काजी सुण रे मुल्लां।\nयामै कौण भया मुरदारूं।।\nजीवां ऊपर जोर करीजै।\nअंतकाल होयसी भारूं।।९।।",
            "ओ३म् बिसमिल्ला रहमान रहीम।\nजिहिँकै सदकैं भीना भीन।।\nतो भेटीलो रहमान रहीम।\nकरीम काया दिल करणी।।\nकलमा करतब कौल कुराणों।\nदिल खोजो दरबेश भईलो।।\nतइया मुसलमाणों।\nपीरां पूरषां जमी मुसल्लां।।\nकर्तब लेक सलामों।\nहम दिल लिल्ला तुम दिल लिल्ला।\nरहम करै रहमाणों।।\nइतने मिसले चालो मीयां।\nतो पावो भिस्त इमाणों।।१०।।",
            "ओ३म् दिल साबत हज काबो नेडै।\nक्या उलबंग पुकारो।।\nसीने सरवर करो बंदगी।\nहक्क निवाज गुजारो।।\nइंहि हेडैं हर दिन की रोजी तो इसही रोजी सारो।।\nआप खुदायबंद लेखो मांगै।।\nरे बिनही गुन्हैं जीव क्यूं मारो।।\nथे  तक जाणों तकपीड़ न जाणों।\nबिन परचें बाद निवाज गुजारो।।\nचर फिर आवै सहज दुहावै।\nजिसका खीर हलाली।।\nतिसके गले करद क्यूं सारो।\nथे पढ़ सुण रहिया खाली।।\nथे चढ़-चढ़ भींते मड़ी मसीते।\nक्या उलबंग पुकारो।।\nकारण खोटा करतब हींणा।\nथारी खाली पड़ी  निवाजूं।।\nकिहिं ओजू तुम धोवो आप।\nकिहिं ओजू तुम खंडा पाप।।\nकिहिं ओजू तुम धरो धियान।\nकिहिं ओजू चीन्हों रहमान।।\nरे मुल्ला मन माहि मसीत निवाज गुजारिये।\nसुणता ना क्या खरै पुकारियै।।\nअलख न लखियो खलक पिछाण्यो।\nचाम कटे क्या हुइयों।।\nहक्क हलाल पिंछाण्यों नाहीं।\nतो निश्चै गाफल दोरै दीयों।।११।।",
            "ओ३म् महमद-महमद न कर काजी।\nमहमद का तो  विषम बिचारूं।।\nमहमद हाथ करद जो होती।\nलोहै घड़ी न सारूं।।\nमहमद साथ पयंबर सीधा।\nएक लख असी  हजारूं।\nमहमद मरद हलाली होता।\n तुम ही भए मुरदारूं।।१२।।\n",
            "ओ३म् कांयरे मुरखा तैं जन्म गुमायों।\nमुंय भारी ले भारू।।\nजादिन तेरे होम नै जाप नै तप नै किरिया।\nगुरु न चीन्हों पंथ न पायों अहल गई जमवारूं।।\nतांती बेला ताव न जाग्यो।\nठाढ़ी बेला ठारूं।।\nबिंबै बेला विष्णु न जंप्यों।\nतातैं बहुत भई कसवारूं।।\nखरी न खाटी देह बिणाठी।\nथीर न पवना पारूं।।\nअहनिश आवं घटंती जावै।\nतेरे स्वास सबी कसवारूं।।\nजां जन मन्त्र विष्णु न जंप्यो।\nते नर कुबरण कालू।।\nजा जन मन्त्र विष्णु न जंप्यो।\nते नगरे कीर कहारूं।।\nजा जन मंत्र विष्णु न जंप्यो।\nकांध सहै दुख भारूं।।\nजा जन मंत्र विष्णु न जंप्यो।\nते घण तण करे।\nअहारूं।।\nजा जन मन्त्र विष्णु न जंप्यो।\nताको लोही मांस बिकारूं।\nजा जन मंत्र विष्णु न जंप्यो।\nगावैं गाडर सहरे सूवर जन्म-जन्म अवतारूं।।\nजा जन मन्त्र विष्णु न जंप्यो।\nओडां के घर पोहण होयसी पीठ सहै दुख भारूं।।\nजा जन मन्त्र विष्णु न जंप्यो।\nराने बासो मोनी बैसे, ढूके सूर सबारूं।।\nजा जन मन्त्र विष्णु न जंप्यो।\nते अचल उठावत भारूं।।\nजा जन मन्त्र विष्णु न जंप्यो।\nते न उतरिबा पारूं।।\nजा जन मन्त्र विष्णु ने जंप्यो।\nते नर दौरे घुप अंधारूं।।\nतांतें तंत न मंत न जड़ी न बूटी।\nऊंडी पड़ी पहारूं।\nविष्णु न दोष किसो रे प्राणी।\nतेरी करणी का उपकारूं।।१३।।",
            "ओ३म् मोरा उपख्यान वेदूं कण तत भेदूं।\nशास्त्रे पुस्तके लिखणा न जाई।।\nमेरा सबद खोजो।\nज्यू सबदे  सबद समाई।।\nहिंरणा दोह क्यूँ हिरण हतीलूँ।\nकृष्ण चरित बने क्यूँ बाघ बिडारत गाई।।\nसुनही सुनहा का जाया।\nमुरदा बघेरी बघेरा न होयबा।।\nकृष्ण चरित बिन।\nसीचाण कबहीं न सुजीऊं।।\nखर का सबद न मधुरी बाणी।।\nकृष्ण चरित बिन, श्वान न कबही गहीरूं।।\nमुंडी का जाया मुंडा  न होयबा।\nकृष्ण चरित बिन, रीछां कबही न सुचीलूं।।\nबिल्ली की इन्द्री संतोष न होयबा कृष्ण चरित बिन, काफरा न होयबा लीलूं।।\nमुरगी का जाया मोरा न होयबा।\nकृष्ण चरित बिन, भाकला न होयबा चीरूं।।\nदंत बिवाई जन्म ने आई।।\nकृष्ण चरित बिन, लोहै पडे न काठ की सूलूं।\nनीबड़िये नारेल न होयबा।\nकृष्ण चरित बिन, छिलरे ने होयबा हीरूं।।\nतूबण नागर बेल न होयबा।\nकृष्ण चरित बिन, बांवली न केली केलूं।\nगऊ का जाया खगा न होयबा।\nकृष्ण चरित बिन, दया न पालत भीलूँ।।\nसूरी का  जाया हस्ती न होयबा।\nकृष्ण चरित बिन, ओछा कबही न पुरूं।।\nकागण का जाया कोकला न होयबा।\nकृष्ण चरित  बिन, बुगली न जनिबा हंसू।\nज्ञानी के हृदय प्रमोद आवत, अज्ञानी लागत डांसू।।१४।।",
            "ओ३म् सुरमां लेणा झींणा सबदूँ।\nम्हे भूल न भाख्या थूलूं।।\nसो पति बिरखा सींच प्राणी।\nजिहिं का मीठा मूल समूलूँ।।\nपाते भूला मूल न खोजो।\nसींचो कांय कु मूलूँ।।\nविष्णु-विष्णु भण अजर जरीजै।\nयह जीवन का मूलूँ।।\nखोज प्रांणी ऐसा बिनाणी।\nकेवल ज्ञानी।।\nज्ञान गहीरूं।।\nजिहिं के गुणे न लाभत छेहूं।।\nगुरु गेंवर गरबा शीतल नीरूं।\nमेवा ही अति मेऊं।।\nहिरदै मुक्ता कमल संतोषी।\nटेवा ही अति टेऊं।।\nचढ़ कर बोहिता भव जल पार।\nलंघावै।\nसो गुरु खेवट खेवा खेहूं।।१५।।",
            "ओ३म् लोहै हूंता कंचन घड़ियों।\nघड़ियों ठाम सुठाऊं।।\nजाटा हूँता पात करीलूं।\nयह कृष्ण चरित परिवाणों।।\nबेंड़ी काठ संजोगे मिलिया।\nखेवट खेवा खेहूं।।\nलोहा नीर किसी बिध तरिबा।\nउत्तम संग सनेहुं।।\nविन किरिया रथ बैसैंला।\nज्यू काठ संगीणी लोहा नीर तरीलूं।।\nनांगड़ भागंड़ भूला महियल।\nजीव हतै मड़ खाईलो।।१६।।\n",
            "ओ३म् मोरै सहजै सुन्दर लोतर बाणी।\nऐसो भयो मन ज्ञानी।।\nतइया सासूं।\nतइया मासूं।\nरक्तू रूहीयूं।।\nखीरूं नीरूं।\nज्यूं कर देखूं।\nज्ञान अंदेसू।\nभूला प्राणी कहै सो करणो।।\nअई अमाणो।\nतत समाणो।\nअइया लो म्हे पुरष न लेणा नारी।।\nसो दत सागर सो सुभ्यागत।\nभवन-भवन भिखियारी।।\nभीखी लो भिखियारी लो।\nजे आदि परमतंत लाधो।\nजांकै बाद बिराम विरांसो सांसौ।\nतानै कौन कहसी साहिल्या साधु।।१७।।\n",
            "ओ३म् जांकुछ-जांकुछ जां कछु न जांणी।\nनाकुछ-नाकुछ तां कुछ जांणी।।\nनाकुछ-नाकुछ अकथ कहाणी।\nनांकुछ-नांकुछ अमृत बाणी।\nज्ञानी सोतो ज्ञानी रोवत।\nपढ़िया रोवत गाहे।।\nकेल करन्ता मोरी मोरा रोवत।\nजोय-जोय पगां दिखाही।।\nउरध खैणी मन उनमन रोवत।\nमुरखा रोवत धाहीं।।\nमरणत माघ संघारत खेती।\nके के अवतारी रोवत राही।।\nजड़िया बूंटी जे जग जीवै।\nतो बैदा क्यूं मर जाही।।\nखोज पिरांणी ऐसा बिनाणीं।\nनुगरा खोजत नाहीं।\nजां कुछ होता ना कुछ होयसी।\nबल कुछ होयसी ताहीं।।१८।।\n",
            "ओ३म् रूप अरूप रमूं, पिण्डे ब्रह्मण्डे।\nघट-घट अघट रहायों।।\nअनन्त जुगां मैं अमर भणी जूं।\nना मेरे पिता न मायों।।\nना मेरे माया न छाया।\nरूप न रेखा।\nबाहर भीतर अगम अलेखा।।\nलेखा एक निरञ्जन लेसी।\nजहां चीन्हों तहां पायों।।\nअड़सठ तीरथ हिरदा भीतर।\nकोई-कोई गुरुमुख बिरला न्हायों।।१९।।",
            "ओ३म् जां जां दया न मया।\nतां तां बिकरम कया।।\nजां जा आव न वैसुं।\nतां तां सुरग न जैसुं।।\nजां जां जीव  न जोती।\nतां तां मोख न मुक्ति।।\nजां जां दया न धर्मू।\nतां तां बिकर्म कर्मू।।\nजां जां पाले न शीलूं।\nतां तां कर्म कुचीलू।।\nजां जां खोज्या न मूलूं।\nतां तां प्रत्यक्ष थूलूं।।\nजां जां भेद्या न भेदू।\nतो सुरगे किसी उमेदूं।।\nजां जां घमण्डै स घमण्डू।\nताकै तावन छायों।\nसूतै सास नसायों।।२०।।",
            "ओ३म् जिहिं कै सार असारूं।\nपार अपारूं।।\nथाघ अथाघूं।\nउमग्या समाघूं।।\nते सरवर कित नीरूं।\nबाजालो भल बाजालो।\nबाजा दोय गहीरूं।।\nएकण बाजै नीर बरसै।\nदूजे मही बिरोलत खीरूं।।\nजिहि कै सार असारू।\nपार अपारूं ।।\nथाघ अथाघूं।\nउमग्या समाघू।।\nगहर गंभीरूं।\nगगन पयाले।।\nबाजत नादूं माणक पायो।।\nफेर लुकायो।\nनहीं लखायो।।\nदुनियां राती बाद विवादूं।\nबाद बिवादे दांणू  खीणा।।\nज्यूं पहूपे खींणा भंवरी भंवरा।\nभावें जाण म जाण पिराणी।।\nजोलै का रिप जंवरा।\nभेर बाजातो एक जोजनो अथवा तो दोय जोजनो।\nमेघ बाजातो पंच जोजनो।।\nअथवा तो दश जोजनो।\nसोई उत्तम लेरे प्राणी।।\nजुगां जुगांणी सत करि जांणी।\nगुरु का सबद ज्यूं  बोलो झींणी बाणी।।\nजिहि का दूरां हूँतै दूर सुणीजै।\nसो सबद गुणा कारूं।।\nगुणा सारू बले अपारूं ।।२१।।\n",
            "ओ३म् लो लो रे राजिंदर रायों।\nबाजै बाव सुवायों।।\nआभै अमी झुरायों।\nकालर करसण कीयों।।\nनेपै कछू न कीयों।\nअइया उत्तम खेती।।\nको को इमृत रायो।\nको को दाख दिखायों।।\nको को ईख उपायों।\n को को नींब निबोलीं।\nको को ढाक ढकोली।।\nको को तूषण तुंबण बेली।\nको को आक अकायों।।\nको को कछु कमायों।\nताका मूलू कुमूलू।।\nडाल कुडालूं।\nताका पात कुपातूं।\nताका फल बींज कुबीजूं।\nतो नीरे दोष किसायों।।\nक्यूं क्यूँ भएभागे ऊंणा।\nक्यूं क्यूं कर्म बिहूंणा।।\nको को चिड़ी चमेड़ी।\nको को उल्लू आयों।।\nताकै ज्ञान न जोती।\nमोक्ष न मुक्ती।।।\nयाके कर्म इसायों।\nतो नीरे दोष किसायों।।२२।।",
            "ओ३म् साल्हिया हुवा मरण भय भागा।\nगाफिल मरणै घणा डरै।।\nसतगुरु मिलियो सत पंथ बतायो।\nभ्रान्त चुकाई।\nमरणै बहु उपकार करै।।\nरतन काया सोभंति लाभै।\nपार गिराये जीव तिरै।।\nपार गिराये सनेही करणी।\nजंपो विष्णु न दोय दिल करणी।।\nजंपो विष्णु न निंदा करणी।\nमांडो कांध विष्णु कै सरणै।।\nअतरा बोल करो जे साचा।\nतो पार गिरायं गुरु की बाचा।।\nरवणां ठवणां चवरां भवणां।\nताहि परे रै रतन काया छै।।\nलाभै किसे विचारे।\nजे नवीये नवणीं।।\nखवीये खवणी, जरिये जरणी।\nकरिये करणी।\nतो सीख हुवां घर जाइये।\nरतन काया सांचे की ढोली।।\nगुरु प्रसादे केवल ज्ञाने।\nधर्म अचारे।\nशीले  संजमे।\nसतगुरु तूठे पाइये।।२३।।",
            "ओ३म् आसण बैसण कूड़ कपट्टण।\nकोई कोई  चींन्हत वोजू बाटे।।\nवोजू बाटे जे नर भया।\nकाचीं काया  छोड़ कैलाशे गया।।२४।।\n",
            "ओ३म् राज न भूलीलो।\nराजेन्द्र दुनी न बंधै  मेरू।।\nपवणा झोलै बीखर जैंला।\nधुंवर तणाजै लोरूं।।\nवोलस आभै तणा लहलोरूं।\nआडा डम्बर केती बार बिलम्बण यो संसार अनेहूं।।\n भूला प्राणी विष्णु न जंप्यो।\nमरण विसारो केहूं।।\nम्हां देखंता देव  दाणूँ सुर नर खीणा।\nजंबू मंझे राचि न रहिबा थेहूं।।\nनदिये नीर न छींलर पाणी।\nधूंवर तणा जे मेहूं।।\nहंस उड़ाणों पंथ बिलंब्यो आसा सास निरास भईलो।।\nताछै होयसी रंड निरंडी देहूं।\nपवणा झोलै बीखर जैला गैंण बिलंबी खेहूं।।२५।।\n",
            "ओ३म् घण तण जीम्या को गुण नाहीं।\nमल भरिया भण्डारूं।।\nआगै पीछै माटी झूलै।\nभूला बहैज भारूं।।\nघणा दिना का बड़ा न कहिबा।\nबड़ा न लंघिबा पारूं।\nउत्तम कुली का उत्तम न होयबा।\nकारण किरिया सारूं।।\nगोरख दीठां सिद्ध न होयबा पोह उतरबा पारूं।।\nकलजुग बरतै चेतो लोई।\nचेतो चेतण हारूं।।\nसतगुरु मिलियो सत पंथ बतायो।\nभ्रांत चुकाई बिद गारातैं उदगा गारूं।।२६।।\n",
            "ओ३म् पढ़ कागल वेदू शास्त्र सबदूं।\nपढ़ सुन रहिया कछु न लहिया।।\nनुगरा उमग्या काठ पखाणो कागल पोथा  ना कुछ थोथा ना कुछ गाया गीऊं।।\nकिण दिश आवै किण दिश जावै।\nमाई लखै न पीऊं।।\nइंडे मध्ये पिण्ड उपन्ना, पिण्डा मध्ये बिम्ब उपन्नां, किण दिस पैठा जीऊं।\nइंडे मध्ये जीव उपन्ना।।\nसुण रे काजी सुण रे मुल्ला।\nपीर ऋषिश्वर रेमस वासी तीरथ वासी किण घट पैठा जीऊं।।\nकंसा सबदे कंस लुकाईं बाहर गई न रीऊं।।\nक्षिण आवै क्षिण बाहर जावै।\nरूत कर बरसत सीऊं।।\nसोवन लंक मंदोदर काजै।\nजोय-जोय भेद विभीषण दीयों।।\nतेल  लियो खल चोपै जोगी।\nतिहिंको मोल थोड़े से कीयों।।\nज्ञाने ध्याने नादे वेदे जे नर लेणा।\nतत भी ताही लीयों।।\nकरण दधीचि सिंवर बल राजा।\nहुई का फल लीयों।।\nतारादे रोहितास हरिचन्द।\nकाया दशबन्ध दीयों।।\nविष्णु अजंप्या जनम अकारथ।\nआके डोडा खीपे फलीयो।।\nकाफर बिबरजत रूहीयूं।\nसेंतू भांतू बहु रंग लेणा।\nसब रंग।\nलेणा रूहीयें।।\nनानारे बहु रंग न राचै काली ऊंन कुजीऊ।\n।\nपाहे लाख मजींठी राता।।\nमोल न जिहिं का रूहीयूं।।\nकब हीं वो ग्रह ऊथरि आवै।\nशैतानी साथे लीयों।।\nठोठ गुरु वृष लीपति नारी।\nजद बंकै जद बीरूं।।\nअमृत का फल एक मन रहिबा।\nमेवा मिष्ट सुभायों।।\nअशुद्ध पुरूष वृष लीपति नारी।\nबिन परचे पार गिराय न जाई।।\nदेखत अन्धा सुणता बहरा।\nतासों कछु न बसाई।।२७।।\n",
            "ओ३म् मच्छी मच्छ फिरै जल भीतर।\nतिहिं का माघ न जोयबा।।\nपरम तंत है ऐसा।\nआछै उरबार न ताछै।\nपारूं।।\nओवड़ छेवड़ कोई न थीयों।\nतिहिं का अन्त लहीबा कैसा।।\nऐसा लो भल ऐसालो।\nभल कहो न कहा गहीरूं।।\nपरम तंत के रूप न रेखा।\nलीक न लेहूं खोज न खेहूं।।\nबर्ण बिबरजत।\nभावैं खोजो बांवन बीरू।।\nमीन का पंथ मीन ही जांणै।\nनीर सुरंगम रहीयूं।।\nसिध का पंथ कोई साधू जाणत।\nबीजा बरतन बहियों।।२८।।",
            "ओ३म् गुरु कै सबद असंख्य प्रबोधी।\nखारसमंद परीलो।।\nखारसमंद परै परेरै।\nचोखडं खारूं पहला अन्त न पारूं।।\nअनन्त कोड़ गुरु कीं दावण बिलम्बी।\nकरणी साच तरीलो।।\nसांझे जमों सबेरे थापण।\nगुरु की नाथ डरीलो।।\nभगवीं टोपीं थल शिर आयो।\nहेत मिलाण करीलो।।\nअंबाराय बधाई बाजै।\nहृदय हरि सिंवरीलो।\n| कृष्ण मया चोखंड कृषाणी।\nजम्बू दीप चरीलो।।\nजम्बूदीप ऐसो चर आयो।\nइसकन्दर चेतायो।।\nमान्यो शील हकीकत जाग्यो।\nहक की रोजी धायों।।\nऊंनथ नाथ कुपह का पोहमा आंण्या।\nपोहका धुर पहुंचायों।।\nमोरै धरतीं ध्यान बनस्पति बासो।\nओजू मंडल छायों।।\nगीर्दू मेर पगांगै परबत।\nमनसा सोड़ तुलायों।।\nऐ जुग चार छतींसां और छतीसां।\nआश्रा  बहै अंधारी, म्हे तो खड़ा बिहायों।।\nतेतीसां की बरग बहां म्हे।\nबारां काजै आयों।।\nबारा थाप घणा न ठाहर मतांतो डीले-डीले कोड़ रचायों।।\nम्हे ऊंचै मण्डल का रायों।\nसमन्द बिरोल्यो वासग नेतो।\nमेर मथांणी थायों।।\nसंसा अर्जुन मार्यो कारज सार्यो।\nजब म्हे रहस दमामा बायो।।\nफेरीं सींत लई जद लंका।\nतद म्हे ऊथे थायों।\nदह सिर का दश मस्तक छेद्या।\nबाण भला निरतायों।।\nम्हे खोजी थापण होजी नाही।\nलह-लह खेलत डायों।।\nकंसा सुरसूँ जूवै रमियां।\nसहजे नन्द हरायों।।\nकूत कुंवारी कर्ण समानो।\nतिहिंका पोह पोह पड़दा छायों।।\nपाहे लाख मजींठी पाखो।\nबन फल राता पींझ पाणी के रंग धायों।।\nतेपण चाखन चाख्या।\nभाखन भाख्या।\nजोय-जोय लियो फल फल केर  रसायों।।\nथे जोग न जोग्या भोग न भोग्या न चीन्हों सुर रायों।।\nकण बिन कूकस कांय पीसो।\nनिश्चै सरी न कायो।।\nम्हे अबधू निर पख जोगी।\nसहज नगर का रायों।।\nजो ज्यूं आवै सो त्यूँ थरपां।\nसाचा सूं सत भायों।\nमोरै मनहीं मुद्रा तनहीं कंथा।\nजोग मारग सहडायों।।\nसात शायर म्हे कुरलै कीयों।\nना मैं पीया न रह्या तिसायों।।\nडाकण शाकण निंद्रा खुध्या ये म्हारै तांबै कूप छिपायो।।\nम्हारै मनहीं मुद्रा तनही कंथा।\nजोग मारग सह लीयो।।\nडाकण शाकण निंद्रा खुध्या।\nऐ मेरे मूल न थीयों।।२९।।\n",
            "ओ३म् आयो हंकारो जीवड़ो बुलायो।\nकह जिवड़ा के करण कमायो।।\nथरहर कंपै जिवड़ो डोलै उत माई पीव न कोई बोलै।।\nसुकरत साथ सगाई चालै।\nस्वामी पवणा पाणी नवण करंतो।।\nचंदे सूरे शीस निवन्तो।\nविष्णु सुरां पोह पछ लहन्तो।।\nइहिं खोटे जन मन्तर स्वामी।\nअहनिश तेरो नाम जपंतो।।\nनिगम कमाई मांगी मांग।\nसुरपति साथ।\nसुरा सू रंग।।\nसुरपति साथ सुरां सूं मेलो।\nनिज पोह खोज ध्याइये।।\nभोम भली कृषाण भी भला।\nबूठो है जहां बाहिये।।\nकरषण करो सनेही खेती।\nतिसिया साख निपाइये।।\nलुणचुण लीयो मुरा तब कीयो।।\nकण काजै खड़ गाहिंये।।\nकणतुस झेड़ो होय नवेड़ो।\nगुरुमुख पवण उड़ाइये।।\nपवणा डोलै तुस उडैलो।\nकणले अर्थ लगाइये।।\nयूं क्यू भलो जे आप न जरिये।।\nऔरां अजर जराइये।।\nयूं क्यूं भलो जे आप न फरिये।\nअवरां अफर फराइये।।\nयूं क्यूं भलो जे आप न डरिये।\nअवरां अडर डराइये।।\nये क्यूं भलो जे आप न मरिये।\nअवरा मारण धाइये।।\nपहलै किरिया आप कमाइये।\nतो औरां न फरमाइये।\nजो कुछ कीजै मरणै पहले।\nमत भल कहि मर जाइये।।\nशौच स्नान करो क्यूं नाहीं।\nजिवड़ा काजै न्हाइये।।\nशौच स्नान कियो  जिन नाहीं।\nहोय भंतूला बहाइये।।\nशील बिबरजित जीव दुहेलो।\nयमपुरी ये संताइये।।\nरतन काया मुख सूवर बरगो।।\nअबखल झंखे पाइये।\nसवामण सोनो करणे पाखो।\nकिण पर वाह चलाइये।\nएक गऊ ग्वाला ऋषि मांगी।\nकरण पखो किण सुरह सुबच्छ दुहाइये।\nकरण पखो किण कंचन दीन्हों।\nराजा कवन कहाइये।।\nरिण ऋध्ये स्वामी करण पाखो।\nकुण हीराडसन पुलाइये।\nकिहिं निश धर्म हुवै धुर पूरो।\nसुर की सभा समाइये।।\nजे नविये नवणी खविये खवणीं।\nजरिये जरणी।\nकरिये करणी।\nतो सीख हुयां घर जाइये।।\nअहनिश धर्म हुवै धुर पूरो।\nसुर की सभा समाइये।।\nकिहिं गुण बिदरो पार पहूंतो।\nकरणै फेर बसाइये।।\nमन मुख दान जु दीन्हों करणै।\nआवागवण जु आइये।।\nगुरुमुख दान जु दीन्हों बिदरै।\nसुर की सभा समाइये।।\nनिज पोह पाखो पार असी पुर।\nजाणी गीत बिवाहे गाइये।।\nभरमी भूला वाद विवाद।\nआचार बिचार न जाणत स्वाद।\nकीरत के रंग राता मुरखा  मन हठ मरै।\nते पार गिराये कित उतरै।।३०।।\n",
            "ओ३म् भल मूल सींचो रे प्राणी।\nज्यू का भल बुद्धि पावै।।\nजामण मरण भव काल जु चूकै।\nतो आवा गवण न आवै।।\nभल मूल सींचो रे प्राणी।\nज्यूं तरवर मेलत डालूं।\nहरि परि हरि की आण न मानी।\nझंख्या झुल्या  आलूं।।\nदेवा सेवा टेव न जांणी।\nन बंच्या जम कालू।\nभूलै प्राणी विष्णु न जंप्यो मूल न खोज्यो।\nफिर-फिर जोया डालूं।।\nबिन रैणायर हीरे नीरे।\nनग न सीपे तके न खोला नालूं।।\nचलन चलंतै।\nबास बसंतै।\nजीव जिवंतै।।\nसास फुरंतै।\nकाया निवंती।\nकांय रे प्राणी विष्णु न घाती भालूं।।\nघड़ी घटंतर पहर पटंतर।\nरात दिनंतर।\nमास पखंतर।\nक्षिण ओल्हरबा कालूं।।\nमीठा झूठा मोह बिटंबण।\nमकर समाया जालूं।।\nकबही को बाइंदो बाजत लोई।\nघड़िया मस्तक तालूं।।\nजीवां जूणी पड़े परासा।\nज्यूं झींवर मच्छी मच्छा जालूं।।\nपहले जिंवड़ो चेत्यो नाहीं।\nअब ऊंडी पड़ी पहारूं।।\nजीवर पिंड बिछोड़ो होयसी।\nता दिन थाक र सिर मारूं ।।३१।।\n",
            "ओ३म् कोड़ गऊ जे तीरथ दानों।\nपंच लाख तुरंगम दानों।।\nकण कंचन पाट पटंबर दानों।\nगज गेंवर हस्ती अति बल दानों।।\nकरण दधीच सिंवर बल राजा।\nश्रीराम ज्यूं बहुत करै आचारूं।।\nजां जां बाद विवादी अति अहंकारी लबद सवादी।\nकृष्ण चरित बिन नाहिं उतरिबा पारूं।।३२।।\n",
            "ओ३म् कवण न हुवा कवण न होयसी।\nकिण न सह्या  दुख भारूं।।\nकवण न गइया कवण न जासी।\nकवण रह्या संसारूं।।\nअनेक अनेक चलंता दीठा।\nकलि का माणस कौन विचारूं।।\nजो चित होता सो चित नाहीं।\nभल खोटा संसारू।।\nकिसकी माई किसका भाई।\nकिसका पख परवारूं।।\nभूली दुनिया मर मर जावै।\nन चीन्हों करता।।\nविष्णु विष्णु तू भण  रे प्राणीं।\nबल बल बारम्बारूं।।\nकसणी कसबा भूल न बहबा।\nभाग परापति सारूं।।\nगीता नाद कवीता नाऊं।\nरंग फटारस टारूं।।\nफोकट प्राणी भरमे भूला।\nभल जे यों चीन्हों करतारूं।।\nजामण मरण बिगोवो चूकै।\nरतन काया ले पार पहुंचै।\nतो आवागवण निवारूं।।३३।।",
            "ओ३म् फुंरण फुंहारे कृष्णी माया।\nघण बरसंता सरवर नीरे।।\nतिरी तिरन्तै तीर।\nजे तिस मरै तो मरियों।।\nअन्नों धन्नों दूधू दहीयूं।\nघीऊं मेऊं देऊं जे लाभंता।\nभूख मरै तो जीवन ही बिन सरियों।।\nखेत मुक्त ले कृष्णौ अर्थो।\nजे कंध हरै तो हरियों।।\nविष्णु जपन्ता जीभ जु थाकै।\nतो जीभिड़ीयां बिन सरियों।\nहरि-हरि करता हरकत आवै।\nतो ना पछतावो करियों।।\nभीखी लो भिखियारी लो जे आदि परमतत लाधो।।\nजाकै बाद विराम बिरांसो सांसो।\nतानै कोण कहसि साल्हिया साधो।।३४।।\n",
            "ओ३म् बल बल भणत व्यासूं।\nनाना अगम न आसूं।।\nनाना उदक उदासूं।\nबल बल भई निरासूं।\nगल मैं पड़ी परासूं।\nजां जां गुरु न चीन्हों।\nतइया सींच्या न मूलूं।\nकोई कोई बोलत थूलूं।।३५।।\n",
            "ओ३म् काजी कथै कुराणों।\nन चीन्हों फरमाणों।।\nकाफर थूल भयाणों जइया गुरु न चीन्हों।।\nतइया सींच्या न मूलूं।\nकोई कोई बोलत थूलूं।।३६।।\n",
            "ओ३म् लोहा लंग लुहारूं।\nठाठां घडैं ठठारूं।।\nउत्तम कर्म कुम्हारूं।\nजइया गुरु न चीन्हों।।\nतइया सींच्या न मूलूँ।\nकोई कोई बोलत थूलूं।।३७।।\n",
            "ओ३म् रे रे पिंड स पिंडू।\nनिरघन जीव क्यूं खंडू।।\nताछै खंड बिहंडू घड़ीये सै घमंडू।।\nअइया पंथ कुपंथू।\nजइया गुरु न चीन्हों तइया सींच्या न मूलूं।\nकोई कोई बोलत थूलूं।।३८।।\n",
            "ओ३म् उत्तम संग सुसंगू।\nउत्तम रंग सुरंगू।।\nउत्तम लंग सुलंगू।\nउत्तम ढंग सुढंगू।\nउत्तम जंग सुजंगू।\nतातैं सहज सुलीलूं।।\nसहज सुपंथू।\nमरतक मोक्ष दवारूं।।३९।।\n",
            "ओ३म् सप्त पताले तिहूं तृलोके चवदा भवने गगन गहीरे।।\nबाहर भीतर सर्व निरंतर।\nजहां चीन्हों तहां सोई।।\nसतगुरु मिलियों सतपंथ बतायो।\nभ्रांत चुकाई।\nअवर न बुझबा कोई।।४०।।",
            "ओ३म् सुण राजेन्द्र सुण जोगेन्द्र।\nसुण शेषिन्द्र सुण सोफिन्द्र।।\nसुण काफिन्द्र।।\nसुण चाचिन्द्र।\nसिद्धक साध कहांणी।।\nझूंठी काया उपजत विणसत।\nजां जां नुगरे थिती न जांणी।।४१।।\n",
            "ओ३म् आयसां काहे काजै खेह भकरूड़ो।\nसेवो भूत मसांणी।।\nघड़े ऊंधै बरसत बहु मेहा।\nतिहिंमा कृष्ण चरित बिन पड़यो न पड़सी पाणी।\nयोगी जंगम नाथ दिगम्बर संन्यासी ब्राह्मण ब्रह्मचारीं।।\nमन हट पढिया पंडित।\nकाजी मुल्ला खेलै आपद वारी।।\nनिश्चै कायूं वायों होयसैं।\nजे गुरु बिन खेल पसारी।।४२।।\n",
            "ओ३म् ज्यूं राजगए राजिन्दर झूरै।\nखोज गए नै खोजी।।\nलाछ मुई गिरहायत झूरै।\nअरथ बिहूंणा लोगी।\nमोर झड़े कृसाण भी झूरें।\nबिंद गए नै जोगी।।\nजोगी जंगम जपिया तपिया।\nजतीं तपी तक पीरूं।\nजिहिं तुल भूला पाहण तोलै।\nतिहि तुल तोलन हीरूं।।\nजोगी सो तो जुग जुग जोगी।\nअब भी जोगी सोई।।\nथे कान चिरावो चिरघट पहरो।\nआयसां यह पाखंड तो जोग न कोई।।\nजटा बधारो जीव सिंघारो।\nआयसां इहि पाखंड तो जोग न होई।।४३।।\n",
            "ओ३म् खरतर झोली खरतर कंथा।\nकांध सहै दुख भारूं।\nजोग तणी थे खबर न पाई।\nकांय तज्या घर बारूं।।\nले सूई धागा सीवण लागा।\nकरड़ कसींदि मेखलीयों।।\nजड़ जटा-धारी लंघे न पारीं।\nबाद बिबादि बेकरणो।।\nथे बीर जपो बेताल धियावो।\nकांय न खोजो ततकणो।।\nआयसां डंडत डंडू मुंडत मुंडू।\nमुंडत माया मोह किसो।।\nभरमी बादी बादे भूला कांय न पाली जीव दयों।।४४।।\n",
            "ओ३म् दोय मन दोय दिल सिंवी न कंथा।\nदोय मन दोय दिल पुली न पंथा।।\nदोय मन दोय दिल कही न कथा।\nदोय मन दोय दिल सुणीं न कथा।।\nदोय मन दोय दिल पंथ दुहेला।।\nदोय मन दोय दिल गुरु न चेला।\nदोय मन दोय दिल बंधी न बेला।\nदोय मन दोय दिल रब्ब दुहेला।।\nदोय मन दोय दिल सूई न धागा।।\nदोय मन दोय दिल भिड़े न भागा।।\nदोय मन दोय दिल भेव न भेऊ।।\nदोय मन दोय दिल टेव न टेऊं।।\nदोय मन दोय दिल केल न केला।।\nदोय मन दोय दिल सुरग न मेला।।\nरावल जोगी तां तां फिरियो।\nअण चीन्हैं के चाह्यो।।\nकांहे काजै दिशावर खेलो।\nमन हठ सीख न कायों।।\nथे जोग न जोग्या भोग न भोग्या।\nगुरु न चीन्हों रायों।।\nकण विण कूकस कांय पीसो।\nनिश्चय सरी न कायों।।\nविण पायचिये पग दुख पावै।\nअबधू लोहै दुखी सकायों।।\nपारब्रह्म की सुद्ध न जांणी।\nतो नागे जोग न पायों।।४५।।\n",
            "ओ३म् जिहिं जोगी के मनही मुदा।\nतनही कंथा पिंडै अगन थंभायों।\nजिहिं जोगी की सेवा कीजै।\nतूठो भव जल  पार लंघावै।।\nनाथ कहावै मर मर जावै।\nसे क्यूं नाथ कहावै।।\nनान्हीं मोटी जीवा जूंणी।\nनिरजत सिरजत फिर  फिर पूठा आवै।।\nहमहीं रावल हमहीं जोगी।\nहम राजा के रायों।।\nजो ज्यूं आवे सो त्यूं थरपां।\nसाचां सूं सत भायो।।\nपाप न छिपां पुण्य न हारां।\nकरां न करतब लावां बारूं।।\n जीव तडैं को रिजक ने मेटू।\nमूवा परहथ सारूं ।।\nदौरे  भिस्त विचालै ऊभा मिलिया काम सवारू।।४६।।",
            "ओ३म् काया कंथा मन जो गूंटो।\nसींगी सास उसासूं।।\n मन मृग राखलै कर कृषांणी।\nयूं म्हे भया उदासूं।।\nहमहीं जोगी हमहीं जतीं।\nहमहीं सती हमहीं राख बा चीतूं।।\nपंच पटण नव थानक साध ले।\nआद नाथ के भक्तूं।।४७।।",
            "ओ३म् लक्ष्मण लक्ष्मण न कर आयसां।\nम्हारे साधां पडैं बिराऊं।।\nलक्ष्मण सो जिन लंका लीवी रावण मारयो।\nऐसो कियो संग्रामू।।\nलक्ष्मण तीन भुवन को राजा।।\nतेरे एक न गाऊं।।\nलक्ष्मण कै तो लख चौरासी जीया जूणी।\nतेरे एक न जीऊं।।\nलक्ष्मण तो गुणवंतो जोगी।\nतेरैं बाद विराऊं।\nलक्ष्मण का तो लक्षण नाहीं।\nशींस किसी बिध नाऊं।।४८।।\n",
            "ओ३म् अवधू अजरा जार ले।\nअमरा राख ले।\nराख ले विन्द की धारणा।।\nपताल का पाणी आकाश कूं चढ़ायले।\nभेंटले गुरु का दरशणा ।।४९।।\n",
            "ओ३म् तइया सांसू तइया मांसू।\nतइया देह दमोई।।\nउत्तम मध्यम क्यूं जाणीजै ? बिबरस देखो लोई।।\nजाके बाद बिराम बिरासों सांसो सरसा भोला चालै।\nताकै भीतर छोत लकोई।।\nजाकै बाद बिराम बिरांसो सांसो भोलो भागे।\nताके मूले छोत न होई।।\nदिल दिल आप खुदायबंद जाग्यो।\nसब दिल जाग्यो सोई।।\nजो जिंदो हज काबै जाग्यो।\nथल सिर जाग्यो सोई ॥ नाम विष्णु कै मुसकल घातै।\nते काफर सैतानी।।\nहिंदू होय कर तीरथ न्हावै।।\nपिंड भरावैं।\nतेपण रह्या इवांणी।।\nजोगी होय कै मूंड मुंडावै कान चिरावै।\nगोरख हटड़ी धोकै।\nतेपण रह्या इवांणी।।\n तुरकी होय हज काबो धोके।\nभूला मुसलमाणी।।\nके के  पुरूष अवर जागैला।\nथल जाग्यो निज बाणी।\nजिहिं कै नादे वेदे शीले सबदे।\nलक्षणे अंत न पारूं।।\nअंजन माहि निरंजन आछै।\nसो गुरु लक्ष्मण कंवारूं।।५०।।\n",
            "ओ३म् सप्त पताले भुयं अंतर अंतर राखिलो।\nम्हे अटला अटलूं।।\nअलाह अलेख अडाल अजूनी शिंभू।पवन अधारी पिंडजलूं।।\nकाया भीतर माया आछै।\nमाया भीतर दया आछै।\nदया भीतर छाया जिहिंकै।\nछाया भीतर | बिंब फलूं।।\nपूरक पूर पूर ले पौण।\nभूख नहीं अन जीमत कौंण।।५१।।\n",
            "ओ३म् मोह मण्डप थाप थाप ले।\nराख राख ले।\nअधरा धरूं आदेस बेसूं।।\nते नरेसूं।\nते नरां अपरं पारूं।।\nरण मध्ये से नर रहियों।\nते नरा अडरा डरूं।।\nज्ञान खड़गूं जथा हाथे।\nकोण होयसी हमारा रिपूं।।५२।।\n",
            "ओ३म् गुरु हीरा बिणजै लेहम लेहूं।\nगुरु नै दोष न देणा।\nपवणा पाणीं जमीं मेहूं।\nभार अठारैं परवत रेहूं।।\nसूरज जोती परै परेरै।\nएती गुरु कै शरणै।।\nकेती पबली अरू जल बिम्बा।\nनवसै नदी निवासी नाला सायर एती जरणा।।\nकोड़ निनाणवै राजा भोगी।\nगुरु के आखर कारण जोगी।।\nमाया राणी राज तजीलो।\nगुरु भेटीलो जोग सझीलो।\nपिंडा देख न झुरणा।।\nकर कृसाणीं बेफायत संठो।\nजो जो जीव पिंडै नीसरणा।।\nआदै पहलू घड़ी अढाई।\nस्वर्गे पहुंता हिरणी हिरणा।।\nसुरां पुनां तेतीसां मेलो।\nजे जीवन्ता मरणों।।\nके  के जीव कुजीव।\nकुधात कलोतर बांणी।\nबादींलो हंकारी  लो।।\nवै भार घणा ले मरणो।।\nमिनखा रै नैं सूतै सोयो खूलै खोयो।\nजड़ पाहन संसार बिगोयो।।\nनिरफल खोड़ भिरांति  भूला।\nआसं किसी जा मरणो।।\nबेसाही अंध पड़यो गल फंध।\nलियो गल बंध गुरु बरजंतै।।\nहेलै श्याम सुन्दर कै  टोटै।\nपारस दुस्तर तरणो।\nनिश्चै छेह पड़ेलो पालो।।\nगोवल बास जू करणो।।\nगोवल वास कमाय ले जिवड़ा।\nसो सुरगा  पुर लहणा।।५३।।\n",
            "ओ३म् अरण विवांणे रै रिव भांणै देव दिवांणे।\nविष्णु पुराणे।।\nबिंबा बाणे सूर उगाणे।\nविष्णु बिबाणे  कृष्ण पुरांणे।\nकायं झंख्यो तै आल पिराणी।\nसुर नर तणीं सबेरूं।\nइंडो फूटो बेला बरती।\nताछै हुई बेर अबेरूं।।\nमेरे परै सो जोयण बिंबा लोयण।\nपुरूष भलो निज बांणी।।\nबांकी म्हारी एका जोती।\nमनसा सास बिबांणी।\nको अचारी अचारे लेणा।\nसंजमे शीलै सहज पतीना।।\nतिहिं अचारी नै चीन्हत कौण।\nजांकी सहजे चूकै आवागवण ।।५४।।\n",
            "ओ३म् रण घटिये कै खोज फिरन्ता।\nसुण सेवन्ता।।\nखोज हस्ती को पायो।\nलूंकड़िये को खोज फिरंता सुण सेवन्ता खोज सुरह को पायो।।\nमोथड़िये कै गूढ खणंता सुण सेवन्ता।\nलाधो थान सुथानो।।\nरांघड़िये को घाट घड़न्ता सुण सेवन्ता।\nकंचन सोनो डायों।।\nहस्ती चड़न्ता गेंवर गुड़न्ता।\nसुणहीं सुणहां भुंकत कायों ।।५५।।\n",
            "ओ३म् कुपात्र कू दान जु दीयो।\nजाणै रैंण अंधेरी चोर जु लीयो।।\nचोर जु लेकर भाखर चढ़ियो।\nकह जिवड़ा तें कैनैं दीयों।।\nदान सुपाते बीज सुखेते।\nअमृत फूल फलीजै।।\nकाया कसोटी मन जो गुंटो।\nजरणा ढाकण दीजै।।\nथोड़े माहिं थोड़ेरो दींजै।\nहोते नाह न कीजै।।\nजोय जोय नाम विष्णु के बीजै।\nअनन्त गुणा लिख लिजै।।५६।।\n",
            "ओ३म् अति बल दानो सब स्नानो।\nगऊ कोट जे  तींरथ दानो।\nबहुत करैं अचारूं।।\nते पण जोंय जोंय पार  न पायो।\nभाग परापति सारूं।\nघट ऊंधै बरषत बहु मेहा।\nनीर थयों पण ठालूं।\nको होयसीं राजा दुर्योधन सो।\nविष्णु सभा मह लाणो।।\nतिणहीं तो जोय जोय पार न पायो।।\nअध विच रहीयों ठालूँ।।\nजपिया तपिया पोह बिन खपिया।\nखप खप गया इवांणीं।।\nतेऊ पार पहुंता नाही।\nताकी धोती रही अस्मानी।।५७।।\n",
            "ओ३म् तउवा माण दुर्योधन माण्या।\nअवर भी माणत  माणू।।\nतउवादान जू कृष्णीं माया।\nऔर भी फूलत दानो।\n तउवा जाण जू सहस्र झूझया और भी झूझत जाणो।।\nतउवा बाणजूं सीता कारण लक्ष्मण खैच्या।\nऔर भी खैंचत बाणौ।।\nजपी तपी तकपीर ऋषीश्वर।\nतोल रह्या शैतानो।।\nतिण किण खैंच न सके।\nशिंभु तणी कमाणू।।\nतेऊ पार पहुंता नाहीं।\nते कीयो आपो भांणो।।\nतेऊ पार पहुंता नाहीं।\nताकी धोती रही अस्माणो।।\nबारां काजै हरकत आई।\nअधबिच मांड्यो थांणो।।\nनारसिंह नर नराज नरवो।\nसुराज सुरवो।।\nनरां नरपति।\nसुरा सुरपति।\nज्ञान न रिंदो।\nबहुगुण चिन्दो।\nपहलू प्रहलादा आप पतलीयो।\nदुजा काजैं काम बिटलीयो।।\nखेत मुक्त ले पंच करोड़ी।।\nसो प्रहलादा गुरु की बाचा बहियों।।\nताका शिखर अपारूं।।\nताको तो बैकुंठे वासो।\nरतन काया दे सोंप्या छलत भण्डारूं।।\nतेऊ तो उरवारे थाणो।\nअई अमाणो।\nतत समाणो।\nबहु प्रमाणो।।\nपार पहुंचण हारा।\nलंका के  नर शूर संग्रामे घणा बिरांमे।।\n काले काने भला तिकंट।\nपहलै जूझ्या बाबर झंट।।\nपड़े ताल समंदा पारी।\nतेऊ रहीया लंकदवारी खेत मुक्तले सात करोड़ी।\nपरशुराम के हुकम जे मूवां।।\nसेतो कृष्ण पियारा।\nताको तो बैकुंठे बासो।\nरतन काया दे सोंप्या छलत भंडारूं।\nतेऊ तो उरवारे थाणो।।\nअई अमाणो।\nपार पहूंचन हारा।।\n काफर खानो बुध्दि भराडो।\nखेत मुक्तले नव करोड़ी राव युधिष्ठर सेतो कृष्ण पियारा।\nताकोतों बैकुण्ठ बासों।।\nरतन काया दे सौंप्या छलत भंडारूं।\nतेऊ तो उरवारे थाणो।।\nअई अमाणो।।\nबहु परमाणो।।\nपार पहूंचन हारा।।\nबारा काजै हरकत आई।\nतातें बहुत भई कसवारूं।।\n५८।।\n",
            "ओ३म् पढ कागल वेदूं शास्त्र शबदूं।\nभूला भूले झंख्या आलूं।।\nअहनिश आव घटंती जावै।\nतेरा सास सबी कसवारूं।।\nकइया चन्दा कइया सूरूं।\nकइया काल बजावत तूरूं।।\nऊर्धक चंदा निरधक सूरूं।\nसुन घट काल बजावत तूरूं ताछै बहुत भई कसवारूं।\nरक्तस बिन्दु पर हस निन्दु।आप सहै तेपण बूझै नहीं गवारूं।।\n५९।।\n",
            "ओ३म् एक दुख लक्ष्मण बंधू हइयों।\n एक दुख बूढै घर तरणी अइयों।।\nएक दुख बालक की मां मुइयों।\nएक दुख औछै को जमवारूं।।\nएक दुख तूठै सैं व्यवहारूं।\nतेरे लक्षणे अन्त न पारूं।\nसहैन शक्ति भारूं।\nकै तैं परशुराम का धनुष जे पइयो।।\nकैतैं दाव कुदाव न जाण्यो भइयूं।\nलक्ष्मण बाण जे दहशिर हइयों।।\nएतो झूझ हमें नहिं जाणो।\nजे कोई जाणै हमारा नाऊं।।\nतो लक्ष्मण ले बैकुण्ठे जाऊं।\nतो बिन ऊभा पह प्रधानो।।\nतो बिन सूना त्रिभुवन थानो।\nकहा हुवो जे लंका लइयो।।\nकहा हुओ जे रावण हइयों।\nकहा हुत्र्प्रा जे सीता अइयों।।\nकहा करूं गुणवन्ता भइयों।\nखल कै साटै हीरा गइयों।।\n६०।।\n",
            "ओ३म् कैतैं कारण कि रिया चुक्यो।\nकैतै सूरज सामो थुक्यो।\nकैतै उभै कांसा मांज्या।\n  कैतैं छान तिणूका खेंच्या।\nकैतै ब्राम्हण निवत  बहोड्या।\nकैतैं आवा कोरंभ चोरया।\nकैतै बाडी का बन फल तोड़या।\nकैतै जोगि का खप्पर  फोड़या।कैतै बाम्हण का तागा तोड्या।\nकैतै बैर बिरोध धन लोड्या।\nकैतैं सूवा गाय का बच्छा बिछोड्या।\nकैतैं चरती पिवती गऊ बिडारी।\nकैतैं हरी पराई नारी।\nकैतै सगा सहोदर मारया।\nकैतैं तिरिया शिर खड्ग उभारया।\nकैतैं फिरतैं दातण कीयो।\nकैतै रण मैं जाय दों दियो।\nकैतैं  वाट कूट धन लीयो किसे सरापे लक्ष्मण ह्इयूं।।६१।।\n",
            "ओ३म् नामैं कारण किरिया चूक्यो।\nनामैं सूरज साम्हो थुक्यो।\nनामैं ऊभै कांसा मांज्या।\nनामैं छान तिणूका खैच्या।\nनामैं ब्राम्हण नवत बहोड्या।\nनामैं आवा कोरंभ चोरया।\nनामैं बाडी का बनफल तोड़या।\nनामैं जोगो का खप्पर फोड़या।\nनामैं ब्राम्हण का तागा तोड्या।\nनामैं बैर बिरोध धन लोड़या।\nनामैं सूवा गाय का बच्छ बिछोड्या।\nनामै चरती पिवति गऊ बिडारी।\nनामैं हरी पराई नारी।\nनामैं सगा सहोदर मारया।\nनामैं तिरिया सर खड़ग उभारया।\nनामैं फिरतैं दातण कियो।\nनामैं रण मैं जाय दों दीयों।\nनामैं वाट कूट धन लियो।\nएक जू ओंगुण रामै कीयों।\nअण हंतो मिरघो मारण गईयो।\nदूजो ओगुण रामै कियो।\nएको दोष आदोषा दियों।\nबनखंड में जद साथर सोइयों।\nजद को दोष तदों को होइयों ॥६२॥",
            "ओ३म् आतर पातर राही रुक्मण।\nमेल्हा मंदिर भोयो।\nगढ़ सोवनां तेपण मेल्हा।\nरहा छड़ा सी जोयों।\nरात पड़ता पाला भी जाग्या।\nदिवस तपंता सूरू।\nऊन्हा ठाढा पवना भी जाग्या।\nघन बरसंता नीरुं।\nदुनीतणा ओचाट भी जाग्या।\nके के नुगरा देता गाल गहीरुं।\nजिहिं तन ऊंना  ओंढां।\nतिहिं ओढता चीरूं।\nजां हाथे जप माली जपां।\n तहां जपंता हीरूं।\n बारा काजै पड्यो विछोहो ।\nसंभल संभल  झूरूं।\nराघो सीता हनवंत पाखों।\nकोन बंधावत धीरूं।\nमागर मणीयां काच कथीरुं।\nहीरस हीरा हीरुं।विखा पटंतर पड़ता आया।\nपूरस पूरा पूरूं।\n जे रिण राहे सूर गहिजै।\nतो सूरस सूरा सूरूं।\nदुखिया है जे सुखिया होयसैं।\nकरसै राज गहिरूं।\nमहा अंगीठी बिरपा ओल्हो।\nजेठ न ठंडा नीरुं।\nपलंग न पोढण।\nसेज न सोवण कंठ रुलंता हिरुं।\nइतना मोह न माने शिम्भु।\n तहीं तहीं सूसीरुं।\nघोडा चोली बाल गुदाई।\nश्री राम का भाई।\nगुरु की बाचा बहियों।\nराघों सिता हनवंत पाखो।\nदुख सुख कासूं कहि ॥६३॥ ",
            "ओ३म् मैं कर भुला मंड पिराणी।\nकाचै कन्ध अगाजूं।\nकाचा कंन्ध गले गल जायसैं।\nबीखर जैला राजों।\nगड़ बड़ गाजा कांय बिबाजा।\nकण बिण कूकस कांय लेणा।\nकांय बोलो मुख ताजों।\nभरमी बादी अति अहंकारी।\nलावत यारी।\nपशुवां पडै भिरांन्ति।\nजीव विणासै लाहै कारणै।\nलोभ सवारथ खायबा खाज अखाजों।\nजो अति काले लेजम काले तेपण खीणा।\nजिहिं का लंका गढ़ था राजों।\nबिन हरित पाखर बिन गज गुडियों।\nबिन ढोला डूमां लाकडीयों।\nजाकै परसण बाजा बाजै।\nसो अपंर पर कांय न जंपो हिंदू मुसलमानों।\nडर डर  जीव कै काजै।\nरावा रंका राजा रांवां।\nरावत राजा  खाना खोजां।\n मीरां मुलका घंघ फकींरा।\nघंघा गुरंवा  सूर नर देंवा।\nतिमर जू लंगा।\nआयसां जोयसां।\nसाह पुरोहितां।\nमिश्रही ब्यासां रुखां बिरंखा।\nआव घटंती।\nअतरा माहे कूणं विशेषो।\n मरणत एको माघों।\nपशु मुकेरुं लहैन फेरूं।\nकहे ज मेरु सब जग केरुं।\nसाचै सै हर कर घणेरूं।\nरिण छाणै ज्यूं बीखर जैला।\nतातैं मेरूं न तेरुं।विसर गया ते माघूं।\nरक्तूं नातूं सेतूं धातूं।\nकुमलावै ज्यूँ सागू।\n।\nजीवर पिंड बिंछोवा होयसी।\nतदिन दाम दुगाणी।\nआडन पैको रती बिसोवा सीझै नाही।ओपिंड काम न काजूं।आवत काया लेआयो थो।\nजातैं सुको जागो।\nआवत खिण एक लाई थी  पर जातै खिणी न लागो।\nभाग परापति कर्मा रेखां।\nदरंगे  जबला जबला माघों।\nबिरखे पान झडे झड़  जायला।\nतेपण तई न लागूं।\nसेतूं दगधूं क वलज कलीयों।\nकुमलावै ज्यूं शागूं।\nऋतूबशंती आई।\nऔर भलेरा शागूं।\nभूला तेण गयारें प्राणी।\nतिंही का खोज न माघूं।\nविष्णु विष्णु भण लई न साई।\nसुर नर ब्रम्हा को न गाई।\nतातैं जवर बिन डसीरे भाई।\nबास बसंतै कीवी  न कमाई।\nजंवर तणा जमदूत दहैला।\nतातैं तेरी कहा न बसाई ॥६४॥ ",
            "ओ३म् तउवा जाग जु गोरख जाग्या।\nनिरह निरंजन निरह निरांलब।\nजुग छ्तीसों एकै आसन बैठा बरत्या।\nअवर  भी अबधू जागत जा़गूँ।\nतउवा त्यागज ब्रम्हा त्यागा।\nअवर भी त्यागत त्यागूं।\nतउवा भाग जो इश्वर मस्तक।\nअवर भी मस्तक भागूं।\nतउवा सीर जो ईशवर गोंरी।\nअवर भी कहियत सीरुं।\nतउवा वीर जो राम लक्ष्मण।\nअवर  भी कहियत बीरों।\nतउवा पाग जो दश शिर बांधी।\nअवर भी बांधत पागो।\nतउवा लाज जो सीता लाजी।\nअवर भी लाजत लाजूं।\nतउवा बाजा राम बजाया।\nअवर बजावत बाजूं ।\nतउवा पाज जो सिता कारण लक्ष्मण बांधी।\nअवर भी बांधत पाजूं।\nतउवा काज जो हनुमत सारा।\nअवर भी सारत काजूं।\nतउवा खागज जो कुम्भकरण महरावण खाज्या।\nअवर भी खावत खागूं।\nतउवा राज दुर्योधन माण्या।\nअवर भी माणत राजूं।\nतउवा रागज कन्हड़ बांणी।\nअवरर भी कहिये रागूं।\nतउवा माघ तुरंगम तेजी।\nटटू तण भी माघूँ।\nतउवा बागज हंसा टोली बुगला टोली भी बागूं।।\nतउवा नाग उद्यावल कहिये।\nगरूड़ सीय भी नागूं।\n तउवा शागज नागरवेली।\nकूकर बगरा भी शागूं।\nजां जां शैतानी करै उफारुं  तां तां महंत फलियों।\nजुरा जम रा़क्षस जुरा जुरिनद्र।\nकंश केशी चंडरुं।\nमधु किचक हिरणाक्ष हिरणाकुस।\nचक्रधर बलदेऊं।।\nपावत बासुदेवो  मंडलीक कांय न जोयबा।\nइहिं धर ऊपर रती न रहिबा रांजू ॥६५॥ ",
            "ओ३म् ऊमाज गुजाज पंज गंज यारी।\nरहिया कुपहीया शैतान कि यारी।\nशैतानलो भल शैतान लो।\nशतान बहो जुग छायो।\nशैतान की कुबध्या न खेती।\nज्यूं काल मध्ये कुचीलू।\nबे राही बे किरियावन्त।\nकुमती दौरे जायसैं।\nशैतानी लोड़त रलियों।\nजां जां शैतान करै उफारुं।\nतां तां महंत न फलियों।\nनील मध्ये कुचील करबा।\nसाध संगिणी थुलूं।\nपोहप मध्ये परमला जोती।\nयूं स्वर्ग मध्ये लीलूं।\nसंसार में उपकार ऐसा।\nज्यूं घण बरसंता नीरूं।।\nसंसार में उपकार ऐसा।\nज्यूं रूंही मध्ये खीरुं ॥६६॥ ",
            "( शुक्ल स्वच्छ अति शुध्द हंस, पापों का नाश करने वाले श्री विष्णु गुरु जम्भेश्वरजी द्वारा उच्चरित सबद )\n'ओ३म् श्री गढ़ आल मोत पुर पाटण भुन्य नागोरी।\nम्हे ऊंडे नीरें अवतार लीयो।\nअठगी ठंगण।\nअदगी दागण।\nअगजा गंजण।\nऊंनथ नाथण।\nअनू नवावन।\nकाहिं को मै खैकाल कीयों।\nकाहीं सुरग मुरादे देसां।\nकाहीं दौरे दियुं।।\nहोम करीलो दिन ठावीलो।\nसहस रचीलो छापर नीबी दूणपूरुं।\n।\nगांम सुंदरीयो छीलै बलदीयो।\nछंदे मन्दे बाल दीयो।\nअजम्है होता नागो बाड़े।\nरैण थंभै गढ़ गागरणो।।\nकुं कुं कंचन सोरठ मरहठ।\nतिलंग दीप गढ गागरणो।\nगढ़ दिल्ली कंचन अर दूणायर।\nफिर फिर  दुनियां परखै लीयों।\nथटै भवनिया अरु गुजरात।\nआछो जाई सवालाब मालवै।\nपरबत माडूँ माहीं ज्ञान कथूं।\nखुरसाण गढ लंका भीतर।\nगूगल खेऊ पैरठयों।\nईडर कोट उजैणी नगरी।\nकहिंदा सिंध पुरी विश्राम लीयों।\n।\nकांय रे सायरा गाजै बाजै।\nघुरै घुरहरै करै इवांणी आप बलूं।\nकिंही गुण सायरा मीठा होता।\nकिंही अवगुण हुओ खार खरुं।\nजद बासग नेतो मेर मथाणी।\nसमंद बिरोल्यो ढोयऊरू।\nरैणायर डोहण पांणी पोहण।\nअसूरां बेधी करण छलूं।\nदशशिर नै जड़ वाचा दीन्हीं।\n तद  मेल्ही अनंत छ्लूं।।\nदहशिर का दश मस्तक छेद्या।\nताणू बाणू लडू कुलूं।\nसोखा बाणू एक बखाणू।\nजाका बहु परवाणुं।\nनिश्चय राखी तास बलूं।\nराय विष्णु से बाद न काजै।\nकांय बधारो दैत्य कुलुं।\nम्हेपण म्हेई थेपण थेई।\nसा पुरुषा की लच्छ कुलूं।\nगाजै गुड़कै से क्युं वीहै।\nजेझल जाकी संहस फणूँ।\nमेरे माय न बाप न बहण न भाई।\nसाख न सैंण न लोक जणो।\nबैकुण्ठे विश्वास बिलम्बण।\nपार  गिरंये मात खिणूं।\n।\nविष्णु विष्णु तू भण रे प्राणी।\nविष्णु भनन्ता अनन्त गुणूं।।\n सहंसे नावैं  सहसे ठावें।\nसहंसे गावै  गाजे बाजे।\nहीरे नीरे  गगन गहीरे।।\nचवदा भवणे तिहूं तृलोके जम्बु दीपे।\n सप्त पताले।\n।\nअई अमाणो।\nतत समाणो।\nगुरु फर्माणो।\nबहु परवाणो।\nअइयां  निरजत सिरजत।\nनान्हीं मोटि जीया जूंणी।\nएती सास फुंरतै सारुं।\nकृष्णी माया धन बरषंता।\nम्हे अगिणी गिणूं फूहारुं।\nकुण जाणै म्हे देव कुदेवों।\nकुण जाणै म्है अलख अभेवों।\nकुण जाणे म्है सुर नर देवों।\nकुण जाणै म्है सुर नर देवों।\nकुण जाणै म्हारा पहला भेवूं।।\n कुण जाणै म्हे ग्यानी के ध्यानी।\nकुण जाणै म्हे केवल ज्ञानी।\nकुण जाणै म्हे ब्रह्मज्ञानी।\nकुण जाणै म्हे ब्रम्हज्ञानी।\nकुण जाणै म्हे ब्रम्हचारी।\nकुण जाणै म्है अल्प अहारी।\nकुण जाणै म्है पुरुष कै नारी।\n।\nकुण जाणै म्हे बाद बिबादी।\nकुण जाणै म्हे लुब्ध सबादी।\nकुण जाणै म्हे जोगि कै भोगी।\nकुण जाणै म्है आप संयोगी।\nकुण जाणै म्हे भावत भोगी।\nकुण जाणै म्है लील पती।\nकुण जाणै म्है सूम क दाता।\nकुण जाणै म्है सती कुसती।\nआप ही सूमर आप ही दाता।\nआप ही कुसती आपें सती।\nनव दाणूं निरवंश गुमाया कैरव किया फती फती।\nराम रुप कर राक्षस हडिया।\nवाण कै आगै बनचर जुड़ीया।\nतद म्हें राखी कमल पती।\nदया रुप म्हे आप बखाणां।\nसंहार रुप म्हे आप हती।\nसौलै सहंस नव रंग गोपी।\nभोलम भालम  टोलम टालम।\nछोलम छालम।।\nसहजै राखीलो म्हे कन्हड बालों आप जती।\nछोलबीया म्हे तपी तपेश्वर।\nछोलब कीया फती।\nराखण मतां तो पडदै राखां।\nज्यूं दाहै पान बणासपती ॥६७॥'\n",
            "ओ३म् वै कंवराई अनंत बधाई।\nवै कंवराई सुराग बधाई।\n।\nयह कंवराई खेह रलाई।\nदुनियां रोलै कंवर किसो।\nकण बिण कूकस रस बिन बाकस।\nबिन किरिया परिवार किसो।\nअरथूं  गरथूं साहण थाटूं।\nधूंवै का लहलोर जिसो।।\nसो शारंगधर जपरे प्राणी।\nजिहिं जपिये हुवै धरम इसो।\nचलन चलंतै बास बसंतै।\nजीव जिवंतै  काया नवंती।\nसास फुरंतै  किवी न कमाई।\nतातै जंवर बिन डसीरे भाई।।\nसुर नर ब्रह्मा कोउ न गाई।\nमाय न बाप न बहन न भाई।\nइंत न मिंत लोक जणो।\nजंवर तण जमदूत दहेला।\nलेखो लेसी एक जणो ॥६८॥ ",
            "ओ३म् जंवरारे तैं जग डांडीलो।\nदेह न जीती जांणो।\nमाया जाले ले जम काले।\nलेणा कोण समाणो।\nकाचै पिंडै किसी बड़ाई।\nभोलै भूल अयाणो।\nम्हां देखंता देव दाणु  सुर नर खीणा।\nबीच गया बेराणो ।\nकुंभकरण महरावण होता।\nअबली जोध अयाणो।\nकोट लंका गढ विषमा होता।\nकांयदा बस गया रावण राणो।\nनौग्रह रावण पाए बन्ध्या ।।\nतिस बीह सुर नर शंक भयाणो।।\nले जम कालें अति बुधवंतो।\nसिता काज लुंभाणो।\nभरमि बादी अति अंहकारी।।\n करता गरब गुमानो।\nतेऊ तो जम काले खीणा।\nथीर न लाधो थाणो।\nकाचैं पिंड अकाज अफारु।\nकिसी पिराणी  माणो।।\nसाबण लाख मझीठ बिगूता।\nथोथा बाजार घाणो।\nदुनियां राचै गाजै बाजै।\nतामै कणू न दाणू।\nदुनियां के रंग सब कोई राचै।\nदीन रचै सो जाणो ।।\nलोही मास बिकारो होयसी।\nमूर्ख फिरै अयाणो।।\nमागर मणियां काच कथीरन राचो।\nकूड़ा दुनी डफाणो।\nचलन चलन्तै।\nजीव जीवन्तै।\nकाया नवन्ती।\nसास फुरंतै।\nकांयरे प्राणी विष्णु न जंप्यो।\nकीयो कंधे को तांणो।\nतिहिं ऊपर आवैला जंवर तणा दल।\nतास किसो सहनाणो।\nताकै शीष न ओढण।\nपाय न पहरण।\nनैवा फूल झयाणो।।\nधणक क बाण न टोपन अंगा।\nटाटर चुगल चयाणो।\nसाल सुंचगी घृत सुबासो।\nपीवण न ठंडा पाणी।\nसेज न सोवण।\nपंलग न पोढण।\nछात न मैडी माणो।\nन वां दइया।\nनवां मइयां।\nनागड दूत भयाणो।काचा तोड़ नीकुचा भाषै।\nघटें मल माणो।\nधरती अरु असमान अगोचर।\nजातैं जीव न तेही जाणो।\nआवत जावत दीसै नाही।\nसाचर जाय अयाणो।\nजंवर तणा जमदूत दहैला।\nमन बैसैं ला मांणो।\nतातै कलीयर कागा रोलो।\nसूना रह्या अयाणो।\nआयसां जोयसां भणता गुणंता।\nवार महूर्ता पोथो थोथा।\nपुस्तक पढीया वेद पुराणों।।\nभुत प्रेती कांय जपीजै।\nयह पाखण्ड परमाणो।\nकान्ह दिशावर जेकर चालो।\nरतन काया ले पार पहूंचो।\nरहसी आवा जाणो।\nतांह परेरै पार गिरांये।\nततकै निश्चल थाणो।\nसो अपरंपर कांय न जंपो।\nततखिण लहो इमाणो।\nभल मूल सींचो रे प्राणी।\nज्यूँ तरवर मेलत डालूं।\nजइया मूल न सींच्यो।\nतो जामण मरण बिगोवो।\nअहनिश करणी थीर न रहिबा।\nन बंच्यो जम कालूं।\nकोइ कोई भल मूल सींची लो।\nभल तंत बूझीलो।\nजा जीवन की विध जाणी।\nजीव तड़ा कछु लाहो होसी।\nमूवा न आवत हांणी ॥६९॥ ",
            "ओ३म् हक हलालूं हक साच कृष्णों।\nसुकृत अह्ल्यो न जाई।\nभल बाहिलो भल बीजीलो।\nपवणा बाड़ बलाई।\nजीव कै काजै खडो ज खेती।\nतमैं ले रखवोलो रे भाई।\nदैतानी शैतानी फिरैला।\nतेरी मत मोरा चर जाई।\nउन मुन मनवा जीव जतन कर।\nमन राखी लो ठाई।\nजीव कै काजै खडो जे खेती।\nवाय दवाय न जाई।\nन तहां हिरणी न तंहा हिरण।\nन चोन्हों हरि आई।\nन तहां मोरा न तंहा मोरी।\nन ऊंदर चर जाई।।\nकोई गुरु कर ज्ञानी तोडत मोहा।\nतेरो मन रखनेवालो रे भाई।\nजो  आराध्यो राव युधिष्ठिर।\nसो आरोधो रे भाई ॥७०॥ ",
            "ओ३म् धवण धूजै पाहण पूजै।\nबे फरमाई खुदाई।।\nगुरु चेले के पाए लागै।\nदेखो लोग अन्यायी।\nकाठि कणजो रुपा रेहण।\nकापड़ माह छिपाई।\nनीचा पड पड तानैं धोकै।\nधीरा रे हरि आई।\nब्राम्हण नाऊं लादण रुड़ा।\nबूता नाऊं कूता।।\nवै  अपहाने पोह बतावै।\nबैर जगावैं सूता।\nभूत परेती जाखा खांणी।\nयह पाखंड परवाणो।\nबल बल कूकस कांय दलीजै।\nजामै कणूं न दाणू।\nतेल लीयो खल चोपै जोगी।\nखलपण सूंघी बिकाणो।।\nकालर बीज न बीज पिराणी।\nथल सिर न कर निवाणो।\nनीर गए छीलर कांय सोधो ।\nरीता रह्या इवाणी।।\nभवंता ते फिरंता।\nफिरंता ते भवंता।\nमडे मसाणे।।\nतड़े तड़गे।\nपड़े पखाणे।\nहवांतो सिध्दि न कोई।\nनिज पोह खोज पिराणी।\nजे नर दाबों छोड्यो मेर चुकाई।\nराह तेतीसों की जाणी ॥७१॥ ",
            "ओ३म् वेद कुराण कुमाया जालूं।\nभूला जीव कु जीव कु जाणी।\nबसंदर नहीं नख हीरुं।\nधर्म पुरुष सिरजीवै पूरुं।\nकलि का मायाजाल फिटाकर प्राणी।\nगुरु की कलम कुरांण पिछाणी।\nदींन गुमान करैलो ठाली।\nज्यूं कण घातै घुण हाणी।।\nसांच सिदक शैतान चुकावो।\nज्यूं तिस चुकावै पाणी।\nमै नर पूरा सरबिण जो हारा।\nलेसी जां कै ह्दय लोयण।\nअंधा रहा इवांणी।\nनिरख लहो नर निरहारी।\nजिन चोखंड भीतर खेल पसारी।\nजंपो रे जिण जंपे लाभै।\nरतन काया ए कहांणी।\nकाहीं मारुं काहीं तारुं।\nकिरीया बिहूंणा पर हथ सारूं।\nशील दहूं उबारुं उन्है।\nएकल एह कहांणी।\nकेवल ज्ञानी थल शिर आयो।\nपरगट खेल पसारी।\nकोड़ तेतीसो पोह रचावण हारी।\nज्यूं छक आई सारी ॥७२॥",
            "ओ३म् वेद कंकहड़ी मंडप मैड़ी।\nजहां हमारा वासा।\nचार चक नव दिप थरथरे।\nजो आपो परकांसू।\nगुणियां म्हारा सुगणा चेला।\nम्हे सुगणा का दासूँ।\nसुगणा होय सैं सुरगे जास्ये।\nनुगरा रहा निरासूं।\nजा का थान सुहाया घर बैकुण्ठे।।\nजाय संदेसो लायो।।\nअमियां ठमियां अमृत भोजन।\nमनसा पलंग सेज निहाल बिछायों।\nजागों जोवो जोत न खोवो।\nछ्ल जासी संसारु।\nभणी न भणबा।\nसुणी न सुणबा।\nकही न कहबा।\nखडी न खडबा।\nरे भल कृषाणी।\nताकै करण न घा तो हेलो।\nकलीकल जुग बरते जैंलो  तातै नही सुरां सो मेलों   ॥७३॥",
            "ओ३म् कड़वा मीठा भोजन भख ले।\nभख कर देखत खीरूं।\nधर आखरडी साथर सोवण।\nओढण ऊना चीरूं।\nसहेज सोवण पोह का जागण।\nजे मन रहिबा थीरूं।\nसुरग पहेली सांभल जिवड़ा।\nपोह उतरबा तीरूं ॥७४॥ ",
            "ओ३म् जोगी रे तू जुगत पिछांणो।\nकाजी रे तू कलम कुरांणी।।\nगऊ बिणासो कांहे तानी।\nराम रजा क्यूँ दीन्हीं दानी।।\nकान्ह चराई रनबे वांनी।\nनिरगुन रुप हमें पतियानीं ।।\nथल शिर रह्या अगोचर बानी।\nध्याय रे मुंडिया पर दानी।\nफीटा रे अण होता तानी।\nअलख लेखो लेसी जानी ॥७५॥",
            "ओ३म् तन मन धोइये संजम हुइये।\nहरष न खोइये।।\nज्यूं ज्यूं दुनिया करै खुवारी।\nत्यूं त्यूं किरिया पूरी।।\nमुग्धां सेती यूं टल चालो।\nज्यूं खडकै पात धंनेरी ॥७६।।\n",
            "ओ३म् भूला लो भल भूला लो।\nभूला भूल न भूलूं।\nजिहिं ठूंठडिये पान न होता।\nते क्यूं  चाहत फूलूं।\nको को कपूर घूंटीलो।\nबिन घूंटी नहीं जाणी।\nसतगुरु होयबा सहजे चीन्हबा।\nजाचंध आल बखाणी।\nओछी किरीया आवै फिरीयां।\nभ्रांती सुरग न जाई।\nअन्त निरंजन लेखो लेसी।\nपर चीन्हे नहीं लोकाई।।\nकण बिन कूकस रस बिन बाकस।\nबिन किरीया परिवारूं।।\nहरि बिन देहरै जांण न पावै।।\nअम्बाराय दवारूं ॥७७॥",
            "ओ३म् नवै पोल नवै दरवाजा।\nअहूंठ कोडरूं  रायजड़ी।।\nकांयरे सींचो बनमाली।\nइंहि बाड़ी तो भेल पड़सी।\n।\nसुबचन बोल सदा सुहलाली।\nनाम विष्णु को हरे सणो।।\nघण तण गड़बड़ कायों वायों।।\n निज बमारग तो बिरला कायों।।\nनिज पोह पाखो पार असी पर।\nजाण म गाहि म गायो गूंणो।।\nश्रीराम में मति थोड़ी।\nजोय जोय कण विण कूकस कायों लेणा ॥७८॥ ",
            "ओ३म् बारा पोल नवै दरसाजी।\nराय अथरगढ थीरूं।।\nइस गढ कोई थीर न रहिबा।\nनिश्चै चाल गया गुरु पीरूं ॥७९॥",
            "ओ३म् जे म्हां सूता रैण बिहावै।\nतो बरतै बिम्बा बारूं।।\nचन्द भी लाजै सूर भी लाजै।\nलाजै धर गैणारूं।।\nपवणा पांणी येपण लाजै।\nलाजै बणी अठारा भारूं।।\nसप्त पताल फुणीदा लाजै।\nलाजै सागर खारूं।।\nजंबूदीप का लोइया लाजै।\nलाजै धवली धारूं।।\nसिध अरू साध मुनिजन लाजै।\nलाजै सिरजण हारूं।।\nसत्तर लाख असी  पर जंपा।\nभले न आवै तारूं।।८०।।",
            "ओ३म् भल पाखंड़ मंडा।\nपहला पाप परा छ्त खंडा।\nजा पाखंडी कै नादे वेदे शीले शबदे वाजत पौण।\nता पाखंडी नै चीन्हत कौण।\nजांकी सहजै चूकै आवा गौण ॥८१॥",
            "ओ३म् अलख अलख तू अलख न लखणा।\nतेरा अनन्त इलोलूं।।\nकौण सी तेरी करणी पूजै।\nकौन सैं तिहिं रुप सतूलूं ॥८२॥",
            "ओ३म् जो नर घोड़े चढ़े पाग न बांधै।\nताकी करणी कौन बिचारुं।\nशुचियारा होयसी आय मिलसी।\nकरड़ा दोजग खारूं।\nजीव तड़े को रिजक न  मेटूं।\nमूवां परहथ सारुं।\nहाथ न धोवै पग न पखालै।\nनाहर सिंघ नर काजूं।।\nजुग अनंत अनंत बरत्या।\nम्हे सून मंडल का राजूं ॥८३॥",
            "ओ३म् मूंड मुंडायो मन न मुंडायो।\nमुहि अब खल दिल लोभी।\nअंदर दया नहीं सुरकाने।\nनिंदरा हडै कसोभी।।\nगुरु गत छुटी टोट पडैला।\nउनकी आवा एकपख सातो वै करणी हूंता खूंधा।।\nअसी सहंस नव लाख भवैला कुंभी दौरे ऊंधा ॥८४॥",
            "ओ३म् भोम भली कृषाण भी भला।\nखेवट करो कमाई।।\nगुरु प्रसाद काया गढ़ खोजो।\nदिल भीतर चोर न जाई।।\nथलिये आय सतगुरु परकाश्यो।\nजोलै पड़ी लोकाई।।\nएक खिण मांहि तीन भवन म्हे पोखां।\nजीवां जूण सवाई।।\nकरण समो दातार न हूवो।\nजिन कंचन बाहू उठाई।।\nसोई कवीसा कवल नवेड़ी।\nजिण सुरह सुबछ।\nदुहाई।\nमेर समो कोई कर न देख्यो।\nसायर जिसीं तलाई।।\nलंक सरीखो कोट न देख्यो।\nसमंद सरीखी खाई।।\nदशरथ सो कोई पिता न देख्यो।\nदेवल देसी माई।।\nसीत सरीखी तिरिया न देखी।\nगरब न करीयों काई।।\nहनमत सो कोई पायक न देख्यो।\nभीम जैसी सबलाई।।\nरावण सो कोई राव न देख्यो।\nजिण चोहचक आन फिराई।।\nएक तिरिया कै राहा बेधी।\nलंका फेर बसाई।।\nसंखा मोहरा सेतम सेतूं।\nताक्यूं बिलगै कांई।।\nब्राह्मण था ते बेदे भूला।\nकाजी कलम गुमाई।।\nजोग बिहूंणा जोगी भूला।\nमुंडीया अकल न कोई।।\nइहिं कलयुग मैं दोय जन भूला।\nएक पिता एक माई।।\nबाप जाणै मेरे हलीयो टोरै।\nकोहर सींचण जाही।।\n| माय जाणै मेरै बहुटल आवै।\nबाजै बिरद बधाई।।\nम्हे शिंभू का फरमाया आया।\nबैठा तखत रचाई।।\nदोय भुजडंडे परवत तोलां।\nफेरां आपण राई।।\nएक पलक मैं सर्ब संतोषां जीया जूण सवाई।।\nजूगां-जूगां को जोगी आयो।\n बैठो आसन धारीं।।\nहाली पूछै पाली पूछै।\nयह कलि पूछण हारी।।\nथली फिरंतो खिलेरी पूछै।\nमेरी गुमाई छाली।।\nबांण चहोड़ पारधियो पूछै।\nकिहिं अवगुण चूकै चोट हमारी।।\n।\nरहोरे मूर्खा मुग्ध गंवारा।\nकरो मजूरी पेट भराई।।\nहै है जायो जीव न घाई।\nमैड़ी बैठो राजेन्द्र पूछे।\nस्वामी जी कती  एक आयु हमारी।।\nचाकर पूछे ठाकर पूछै और पूछे कीर कहारी।।\nसोक दुहागण तेपण पूछै।\nले ले हाथ सुपारी।।\nबांझ तिरिया बहुतेरी पूछे।\nकिसी परापति म्हारी।।\nत्रेता जुग मैं हीरा विणज्या।\nद्वापुर गऊ चराई।।\nवृन्दावन मैं बंसी बजाई।\nकलजुग चारी छाली।।\nनव खेड़ी म्हें आगै खेड़ी।\nदशवें कालंके की बारी।।\n उत्तम देश पसारो मांड्यो।\nरमण बैठो जुवारी।।\nएक खंड बैठा नवखंड जीता।\nको ऐसो लहो  जुवारी।।८५।।",
            "ओ३म् जुग जागो जुगजाग पिरांणी।\nकांय जागंता सोवो।।\nभलकै बीर बिगोवो होयसी।\nदुसमन कांय लकोवो।।\nले कूंची दरबान बुलावो।\nदिल ताला दिल खोवो।।\nजंपो रे जिण जंप्यो जणीयर।\nजपसी सो जिण हारी।।\nलह-लह दाव पड़ेता खेलो।\nसुर तेतीसां सारी।।\nपवन बंधान काया गढकाची।\nनीर छलै ज्यूं पारी।।\nपारी  बिनसै नीर ढुलैलो।\nओ पिंड काम न कारी।।\nकाची काया दृढ़ कर सींचो।\nज्यूं माली सींचै बाड़ी।।\nले काया बासंदर होमो।\nज्यूं  ईंधन की भारी।।\nशील स्नाने संजमे चालो।\n पाणी देह पखाली।।\nगुरु के वचने निव खिंव चालो।\nहाथ जपो जपमाली।।\nवस्तु पियारी खरचो क्यूं नाहीं।\nकिहिं गुण राखो टाली।।\nखरचे लाहो राखे टोटो।\nबिबरस जोय निहाली।।\nघर आगी इत गोवल बासो।\nकुडी आधो चारी।।\nआज मूवा कल दूसर दिन है।\nजो कुछ सरै तो सारी।।\nपीछे कलीयर कागा रोलो।\nरहसी कूक पुकारी।।\nताण थकै क्यूं हारयो नाहीं।\nमुरखा अवसर जोला हारी।।८६।।\n",
            "ओ३म् जिहि का उमग्या समाघूं।\nतिहिं पंथ के बिरला लागू।।\nबीजा चाकर बीरू।\nरिण शंख धीरूं।।\nकबही झूझत रायूं।\nपासै भाजत भायों।।\nतातैं नुगरा झूझ न कीयों।।८७।।।\n",
            "ओ३म् गोरख लो गोपाल लो।\nलाल गवाल लो।।\nलाल लीलंग देवों।\nनवखंड प्रथिवी प्रगटियो।।\nकोई बिरला जाणत म्हारीं।\nआद मूल का भेवो।।८८।।\n",
            "ओ३म् उरधक चन्दा निरधक सूरूं।\nनव लख तारा नेड़ा न दूरूं।।\nनव लख चन्दा नव लख सूरूं।\nनव लख धंधू कारूं।।\nतांह परेरै तेपण होता।\nतिहंका करूं  बिचारूं।।८९।।",
            "ओ३म् चोईस चेड़ा कालिंग केड़ा।\nअधिक कलावंत आयसैं।\n वै फेर आसन मुकर होय बैसैंला।\nनुगरा थान रचायसैं।।\nजाणत भूला महा पापी।\nबहू दुनियां भोलायसें।।\nदिल का कूड़ा कुड़ीयारा।\nउपंग बात चलाय सैं।।\nगुरु गहणा जो लेवै नाहीं।\nदशबंध घर बोसायसैं।।\nआप थापी महापापी।\nदग्धी परलै जायसें।।\nसतगुरु कै बैडै न चढ़े।\nगुर स्वामी नै भाय सैं।।\nमंत्र बेलु ऋध सिध कर सैं।।\nदे दे कार चलायसें।।\nकाठ का घोड़ा निरजीवता सरजीव कर सैं।\nतानै दाल चरायसैं।\nअधर आसण मांड बैसैंला।\nमूवा मड़ा हंसाय सैं।।\nजां जां पवन आसण।\nपाणी आसण चंद आसण।\nसूर आसण।\nगुरु आसण संभराथले।।\nकहै सतगुरु भूल मत जाइयो।\nपड़ोला अभै दोजखे।।१०।।\n",
            "ओ३म् छंदे मंदे बालक बुद्धे।\nकूड़े कपटे ऋध न सिद्धे।।\nमेरे गुरु जो दीन्हीं शिक्षा।\nसर्व आलिंगण फेरी दीक्षा।।\nजाण अजाण बहींया जब जब।\nसर्व आलिंगण मेटे तब तब।।\nममता हस्ती बांध्या काल।\nकाल पर काले पसरत डाल।।\nध्यान न डोले मन न टले।\nअहनिश ब्रह्म ज्ञान उच्चरै।\nकाया पत नगरी मन पत राजा।\nपञ्च आत्मा परिवारूं।।\nहै कोई आछै मही मंडल शूरा।\nमनराय सूं झूझ रचायले।।\nअथगा थगायले।\nअवसा बसायले।\nअनबे माघ पाल ले।।\nसत-सत भाषत गुरु रायों।\nजरा मरण भो भागूं।।९१।।\n",
            "ओ३म् काया कोट पवन कुट वाली।\nकुकर्म कुलफ बणायो।।\nमाया जाल भरम का संकल।\nबहु जग रहीया छायों।।\nपढ़ वेद कुरांण कुमाया जालों।\nदंत कथा जुग छायो।।\nसिध साधक को एक मतो।\nजिन जीवत मुक्त दृढ़ायों।।\nजुग जुगां को जोगी आयों।।\nसतगुरु सिद्ध बतायो।।\nसहज स्नानी केवल ज्ञानी ब्रह्मज्ञानी।\nसुकृत अहल्यो न जाई।।\nक्यूं क्यूं भणतां।\nक्यूं क्यूं सुणतां।\nसमझ बिना कुछ सिद्धि न पाई।।९२।।\n",
            "ओ३म् आद सबद अनाहद बांणी।\nचवदै भवण रह्या छल पाणी।।\nजिहिं पाणी से इंड ऊपना।\nउपना ब्रह्मा इन्द्र मुरारी।।९३।।\n",
            "ओ३म् सहंस्र नाम सांईभल शिंभु।\nम्हे उपना आदि मुरारी।।\nजद मैं रहयो निरालंभ होकर।\nउतपति धंधुकारी।।\nना मेरै  मायन ना मेरै बापन।\nमैं अपनी काया आप संवारी।।\nजुग छतीसों शून्यहि बरत्या।\nसतजुग माहीं सिरजी सारी।।\nब्रह्मा इन्द्र सकल जग थरष्या।\nदीन्ही करामात केतीवारी।।\nचन्द सूर दोय साक्षी थरप्या।\nपवन पवनेश्वर पवन अधारी।।\nतदम्हे रूप कीयो मैनावतीयो।\nसत्यव्रत को ज्ञान उचारी।\nतदम्हे रूप रच्यो कामठीयो।\nतेतीसों की कोड़ हंकारी।।\nजब मैं रूप धरयो वाराहीं।\nपृथिवी दाढ़ चढ़ाई सारी।।\nनरसिंघ रूप धर हिरण्यकश्यप मार्यो।\nप्रहलादो रहियो शरण हमारी।।\nबावन होय बलिराज चितायो।\nतीन पैंड कीवीं धरसारी।।\nपरशुराम होय क्षत्रियपन साध्यो।\nगर्भ न छूटी नारी।।\nश्री राम शिर मुकुट बंधायो।\nसीता के अहंकारी।।\nकन्हड़ होय कर बंसी बजाई गऊ चराई।।\nधरती छेदी।\nकाली नाथ्यो।\nअसुर मार किया क्षयकारी।।\nबुद्ध रूप गयासुर मार्यो।\nकाफर मार किया बेगारी।।\nपंथ  चलायो राह दिखायो।\nनौवर विजय हुई हमारी।\nशेष जंभराय आप अपरंपर।\nअवल दिन से कहियो।।\nजांभा गोरख गुरु अपारा।।\nकाजी मुल्ला पढ़िया पंडित।\nनिंदा करै गिवारा।।\nदोजख छोड़ भिस्त जे चाहो।\nतो कहिया करो हमारा।।\nइन्द्रपुरी बैकुण्ठे बासो।\nतो पावो मोक्षहिं द्वारा।।९४।।\n",
            "ओ३म् बाद बिवाद फिटाकर प्राणी।\nछाडो मनहट मन का भाणो।।\nकांही कै मन भयो अंधेरो।\nकांही सूर उगाणो।।\nनुगरा कै मन भयो अंधेरो।\nसुगरा सूर उगाणो।।\nचरणभि रहीया लोयण झुरीया।\nपिंजर पड्यो पुराणो।।\nबेटा बेटी बहन रू भाई।\nसबसै भयो अभाणो।\nतेल लियो खल चोपै जोगी।\nरीता रहीयो घांणो।।\nहंस उडाणो पंथ बिलब्यो।\nकीयो दूर पयाणो।।\nआगै सुरपति लेखो मांगै।कहि जीवड़ा के करण कमाणो।।\nजीवड़ा नै पाछो सूझण लागो।\nसुकरत नै पछताणो।।९५।।\n",
            "ओ३म् सुण गुणवंता सुण बुधवंता।\nमेरी उत्पत्ति आदि लुहारूं।।\nभाठी अंदर लोह तपीलो।\nतंतक सोना घडै कसारूं।।\nमेरी मनसा अहरण नाद हथोड़ो।\nशशीयर सूर तपीलो।।\nपवन अधारीं खातूं।\nजै थे गुरु का सबद मानीलो।\nलंघिबा भव जल पारूं।।\nआसण छोड़ि सुखासण बैठो।।\nजुग जुग जीवै जंभ लुहारूं।।९६।।।\n",
            "ओ३म् विष्णु-विष्णु तू भण रे प्राणी।\nजो मन मानै रे भाई।।\nिन का भूला रात न चेता।\nकांय पड़ा सूता आस | किसी मन थाई।।\nतेरी कुड़ काची लगवाड़ घणो छै।\n कुशल किसी मन भाई।।\nहिरदै नाम विष्णु को जंपो।\nहाथे करो टवाई।।\nहरि परहर की आंण न मानी।\nभूला भूल जपी महमाई।।\nपाहन प्रीत फिटा कर प्राणी।\nगुरु बिन मुक्त न जाई।।\nपंच क्रोड़ी ले प्रहलाद उतरियो।\nजिन खर तर करी कमाई।\nसात क्रोड़ी ले राजा हरिचंद उतरियो।\nतारादे रोहिताश हरिचन्द हाटोहाट बिकाई।।\nनव क्रोड़ी राव युधिष्ठिर ले उतरियो।\nधन-धन कुन्ती माई।।\nबारा क्रोड़ समाहन आयो।\nप्रहलादा सू वाचा कवल जु थाई।।\nकिसकी नारी बस्त पियारी।\nकिसका बहिन रू भाई।।\nभूली दुनियां मर मर जावै।\nना चीन्हों सुरराई।।\nपाहण नाऊं लोहा सक्ता।\nनुगरा चीन्हत कांई।।९७।।\n",
            "ओ३म् जिहि गुरु कै खिणहीं ताऊ खिणहीं सीऊं।\nखिणही पवणा खिणहीं पाणी।\nखिणहीं मेघ मंडाणो।।\nकृष्ण करंता बार न होई।\nथल सिर नीर निवाणो।।\nभला प्राणी विष्णु जंपो रे।\nज्यूं मौत टलै जिरवाणो।।\nभीगा है पण भेद्या नाहीं।\nपांणी मांहि पखाणो।।\nजीवत मरो रे जीवत मरो।\nजिन जीवन की बिध जांणी।।\nजे कोई आवै हो हो कर।\nआप जै हुईये पांणी।।\nजाकै बहुती नवणी बहुती खवणी।\nबहुती क्रिया समाणीं।।\nजाकी तो निज निर्मल काया।\nजोय जोय देखो ले चढ़ियो अस्मानीं।।\nयह मढ देवल मूल न जोयबा।\nनिज कर जपो पिराणी।।\nअनन्त रूप जोवो अभ्यागत।\nजिहिंका खोज लहो सुर बाणी।।\nसेतम सेतूं।\nजेरज जेरूं।\nइंडस इंडू।\nअइयालो उरध जे खैणी।।९८।।\n",
            "ओ३म् साच सही म्हे कूड़ न कहिबा।\nनेड़ा था पण  दूर न रहीबा।।\nसदा सन्तोषी सत उपकरणां।\nम्हे तजीया मान अभिमानूं।।\nबस कर पवणा बस कर पाणी।\nबस कर हाट पटण दरवाजों।।\nदशे दवारे ताला जड़ीया।\nजो ऐसा उसताजों।।\nदशे दवारे ताला कूंची।\nभीतर पोल बणाई।।\nजो आराध्यो राव युधिष्ठिर।\nसो आराधो रे भाई।।\nजिहिं गरु कै झुरैन झुरबा खिरैन खिरंणा।\nबंक तृबंके।।\nनाल पै नालै।\nनैंणे नीर न झुरबा।\nबिन पुल बंध्या बांणो।।\nतज्या अलिंगण तोड़ी माया।\nतन लोचन गुण बांणो।।\nहालीलो भल पालीलो सिध पालीलो।\nखेड़त सूना राणो।।९९।।\n",
            "ओ३म् अर्थं गर्थे साहण थाटूं।\nकूड़ा दीठो ना ठाटों।।\nकूड़ी माया जाल न भूलीरे राजेन्द्र अलगी रही ओजू की बाटों।।\nनवलख दंताला बार करीलो।\nबार करे कर बंद करीलो।।\nबंद करे कर दान करींलो।\nदान करे कर मन फूलीलो।।\nतंत मंत बीर बेताल करीलो।\nखायबा खाज अखाजूं।।\nनिरह निरंजन नर निरहारी।\nतऊ न मिलबा झंझा भाग अभागूं।।१००।।",
            "ओ३म् नितही मावस नित संकरांति।\nनितही नवग्रह वैसें पांति।।\nनितही गंग हिलोले जाय।\nसतगुरु चीन्है सहजै न्हाय।।\nनिरमल पाणी निरमल घाट।\nनिरमल धोबी मांड्यो पाट।।\nजेयो धोबी जाणै धोय।\nघर में मैला वसत्र रहै न कोय।।\nएक मन एक चित साबण लावै।\nपहरंतो गाहक अति सुख पावै।।\nऊंचै नीचे करै पसारा।\nनाहीं दूजे का संचारा।\nतिल मैं तेल पहुप मैं बास।\nपांच तंत मैं लियो  प्रकाश।।\nबिजली कै चमकै आवै जाय।\nसहज शून्य मैं रहै  समाय।।\nनैं यो गावै न यो गवावै।\nसुरगे जाते बार न लावै।।\nसतगुरु ऐसा तंत बतावै।\nजुग जुग जीवै बहुर न आवै।।१०१।।\n",
            "ओ३म् विष्णु-विष्णु भण अजर जरीजै।\nधर्म हुवै पापां छूटीजै।।\nहरि पर हरि को नाम जपीजै।\nहरियालो हरि आण हरूं।\nहरी नारायण देव नरूं।।\nआशा सास निरास भईलो।\nपाईलो मोक्ष दवार खिणू।।१०२।।\n",
            "देखा अदेख्या सुण्या असुन्या ।\n क्षिमा रूप ताप कीजै ।\nथोड़े मनही थोडेरो दीजे ।\n होते ना न कीजै।\nकृष्ण माया तिन्हू लोका साक्षी।\nअमृत फूल फलिजैं।\nजोय-जोय नावं विष्णु के दीजै ।\nअनंत गुणा लिख लीजे।",
            "कंचन दानु कुछ न मानू  ! कापड दानु कुछ न मानू !!\nचोपड दानु कुछ न मानू  ! पाट  पटम्बर दानु कुछ न मानू  !!\nपंच लाख तुरंगम दानु कुछ न मानू  ! हस्ती दानु कुछ न मानू  !!\nतिरिया दानु कुछ न मानू  ! मानू  एक सुचील सिनानु!!\n",
            "ओ३म् आप अलेख उपन्ना शिंभू।\nनिरह निरंजन धंधूकारूं।।\nआपै आप हुआ अपरंपर।\nनै तद चन्दा नै तद सूरूं।।\nपवण न पाणी धरती आकाश न थीयों।\nनातद मास न वर्ष न घड़ी न पहरूं।\nधूप न छाया ताव न सीयों।।\n| न त्रिलोक न तारामंडल।\nमेघ न माला वर्षा थीयों।।\nन तद जोग नक्षत्र तिथि न बारसीयो।\nना तद चवदश पूनो मावसीयो।।\nनै तद समद न सागर न गिरि न पर्वत।\nना धौलागिर मेर थीयों।।\nना तद हाट न बाट न कोट न कसबा।\nबिणज न बाखर लाभ थीयों।।\nयह छत धार बड़े सुलतानो।\nरावण राणा ये दिवाणा हिन्दू मुसलमानू।।\nदोय पंथ नाहीं जूवा जूवा।\nना तद कामन करसण जोगन दर्शन।।\nतीर्थ वासी ये मसवासी।\nना तद होता जपिया तपिया।\nन खच्चर हींवर बाज थीयों।।\nना तद शूर न वीर न खड़ग न क्षत्री।।\nरण संग्राम न जूझ न थीयों।।\nना तद सिंह न स्यावज मिरग पंखेरूं।\nहंस न मोरा लेल सूवो।।\nरंग न रसना कापड़ चोपड़।\nगोहूं चावल भोग थीयों।।\nमाय न बाप न बहण न भाई।\nनातद होता पूत धीयों।।\nसास न सबदूं जीव न पिंडू ना तद होता पुरूष त्रियों।।\nपाप न पुण्य न सती कुसती।\nना तद होती मया न दया।।\nआपै आप ऊपनां शिम्भू।\nनिरह निरंजन धन्धू कारूं।।\nआपो आप हुआ अपरंपर।\nहे राजेन्द्र लेह विचारूं।।१०५।।\n",
            "ओ३म् सुणरे काजी सुणरे मुल्ला सुणियो लोग लुगाई।।\nनर निरहारी एकल वाई।\nजिन यो राह फुरमाई।।\nजोर जरब करद जे छाड़ो।\nतो कलमा नाम खुदाई।।\nजिनकै साच सिदक इमान सलामत।\nजिण यो भिस्त उपाई।।१०६।।।\n",
            "जुगे जुगन्तर भवे भवन्तर।\nकहों कहांणी कासूं।।\nरवि ऊगा जब उल्लू अन्धा।\nदुनियां भया उजासूं।।\nसतगुरु मिलियो सतपंथ बतायो भ्रांत चुकाई।\nसुगरां भयो बिसवासूं।।\nजां जां जांण्यो तहां प्रवाण्यो।\nसहज समाणो।\nजिहिं के मन की पूगीं आसूं।।\nजहां गुरु न चीन्हों पंथ न पायो।\nतहां गल पड़ी परासूं।।१०७।।",
            "ओ३म् हालीलो भल पालीलो सिध पालीलो।\nखेड़त सूना राणो।।\nचन्द सूर दोय बैल रचीलो।\nगंग जमन दोय रासी।।\nसत संतोष दोय बीज बीजीलो।\nखेती खड़ी अकासी।।\nचेतन रावल पहरै बैठे।\nमृगा खेती चर नहीं जाई।।\nगुरु प्रसादे केवल ज्ञाने।\nब्रह्मज्ञाने सहज स्नाने।\nयह घर ऋध सिध पाई।।१०८।।\n",
            "ओ३म् देखत भूली को मनमानै।\nसेवै बिलोवै बांझ सनानै।।\nदेखत भूली को मन चेवै।\nभीतर कोरा बाहर भेवै।।\nदेखत भूली को मन मांनै।\nहरि पर हर मिलियो शैताने।।\nदेखत भूली को मन चेवै।\nआक बखांणै थंदे मेवै।।\nभूलालो भल भूलालो।\nभूला भूल न भूलू।।\nजिहिं ठूठड़िये पान न होता।\nते क्यूं चाहत फूलूं।।१०९।।",
            "ओ३म् मथुरा नगर की राणी होती।\nहोती पाटमदे राणी।।\nतीरथ वासी जाती लूटे।\nअति लूटे खुरसाणी।।\nमानक मोती हीरा लूट्या।\nजाय बीलूधा दांणी।।\nकवले चूकी बचने हारी।\nजिहिं औगुण ढांची ढोवै पांणी।।\nविष्णु कूं दोष किसो रे प्राणी।\nआपे खता कमाणी।।११०।।",
            "ओ३म् खरड़ ओढीजै तूंबा जीमीजैं।\nसुरहै दुहीजै।\nकृत खेत की सींव मैं लीजै।।\nपीजै ऊंडा नीरूं।\nसुर नर देवा बंदी खानै।\nतित उतरीया तीरूं।।\nभोलंब भालब।\nटोलम टालम।\nज्यूं  जाणो त्यू आणो।।\nमैं बाचा दइ प्रहलादा सूं  सूचेलो गुरु लाजै।\nकोड़ तेतीसूं  बाड़े दीन्हीं।\nतिनकी जात पिछाणो।।१११।।\n",
            "ओ३म् जांके पंथ का भांजणा।\nगुरु का नींदणा।\nस्वामी का दुस्मणा।\nकुफर ते काफरा।।\nकुमली कुपातूं कुचिला कुधातूं।\nहड़ हड़ा भड़ हड़ा।\nदाणबे दूतबा दाणबे भूतबा।।\nराकसा बोकसा।\nजांका जन्म नहीं पर कर्म चंडालूं।।\nऔर कूं जिभे कर आप कूं पोखणा।\nजिहिंकी रूवा ले दी जैसीं।\nदोरै घुप अंधारौं।।\nतान बे तानबा छान बे छानबा।\nतोड़ बे तोड़बा।\nकूक बे पुकारबा।\nजांकी कोई न करबा सारूं।।११२।।",
            "ओ३म् ईमा मोमण चीमा गोयम।\nमहंमद फुरमानीं।।\nउरका फुरका निवाज फरीजां।\nखासा खबर बिनाणी।।\nइला रास्ती ईमा मोमन।\nमारफत मुल्लाणी।।११३।।\n",
            "ओ३म् सुरनर तणो सन्देसो आयो।\nसांभलीयो रे  जाटो।।\nचांदणै थकै अंधेरै क्यूं चालो।\nभूल गया गुरु बाटो।।\nनीर थकै घट थूल क्यूं राखो।\nसबल बिगोवो खाटो।।\nमागर मणियां क्यूं हाथि बिसाहो।\nकांय हीरा हाथ उसाटो।।\nसुरनर तणो संदेशो आयो।\nसांभलियो रे जाटो।।११४।।\n",
            "ओ३म् म्हे आप गरीबी तन गूदड़ियों।\nमेरा कारण किरिया देखो।।\nबिन्दो ब्योहरो ब्योर विचारो।\nभूलस नाही लेखों।।\nनदिये नीरूं सागर हीरूं।\nपवणा रूप फिरै परमेश्वर।।\nबिंबै बेला निश्चल थाघ अथाघूं।\nउमग्या समाघूं।\nते सरवर कित नीरूं।।\nगहर गंभीरू।\nखिण एक सिद्धपुरी विश्राम लियों।।\nअब जु मंडल भई अवाजूं।\nम्हे शून्य मंडल का राजू।।११५।।",
            "ओ३म् आयसां मृगछाला पावोड़ी कांय फिरावो।\nमतूंत आयसां ऊगंतो भांण थंभाऊं।।\nदोनों परबत मेर उजागर।\nमर्तृत अधबिच आन भिडाऊं।।\nतीन भुवन की।\nराही रूकमण।\nमतूंत थल सिर आंण बसाऊं।।\nनवसै नदी निवासी नाला।\nमतूंतो थल सिर आन बहाऊं।।\nसीत बहोड़ी लंका तोड़ी।\nऐसो कियो संग्रामो।।\nजां बांगै म्हे रावण मारयो।\nमतूतो आयसां गढ़ हथनापुर सै आन दिखाऊं।।\nजो तू सोने की मृगी कर चलावै।\nमतूंत घन पाहण बरसाऊं।।\nमृगछाला पावोड़ी कांय फिरावो।\nमतूं तो उगंतो भाण थंमाऊं।।११६।।\n",
            "ओ३म् टूका पाया मगर मचाया ज्यूं हंडियाया कुत्ता।।\nजोग जुगत की सार न जाणी।\nमूड मुंडाय बिगूता।।\nचेला गुरु अपरचै खीणा।\nमरते मोक्ष न पायो।।११७।।\n",
            "ओ३म् सुरगा हूंते शिंभू आयो।\nकहौ कूणां के काजै।।\nनर निरहारी एकलवाई।\nपरगट जोत बिराजै।।\nप्रहलादा सूं वाचा कीवी।\nआयो बारां काजै।।\nबारां मैं सू एक घटै तो।\nसू चेलो गुरु लाजै।।११८।।\n",
            "ओ३म् विष्णु-विष्णु तू भण रे प्राणी।\nपैंकै लाख उपाजूं।।\nरतन काया बैकुंठे बासो।\nतेरा जरामरण भय भाजूं।।११९।।\n",
            "ओ३म् विष्णु-विष्णु तू भणरे प्राणीं।\nइस जीवन के हावै।।\nक्षण-क्षण आवै घटंती जावै।\nमरण दिनों दिन आवै।।\nपालटीयो गढ़ कांय न चेत्यो।\nघाती रोल भनावै।।\nगुरु मुख मुरखा चढे न पोहण मनमुख भार उठावै।\nज्यूं ज्यूं लाज दुनी की लाजै।\nयूं त्यूं दाब्यो दावै।।\nभलियो होयसो भली बुध आवै।।\nबुरियो बुरी कमावै।।१२०।।\n",
    };

    boolean isActive = false;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_shabadwani);
        mContext = this;
        isActive = true;

        setWindow();
        initViews();
        set_shabadAdapter();
        checkAds();
    }

    private void checkAds() {
        Log.e(TAG, "ADManagement: Posiiton 1");
        DatabaseReference adsReference = FirebaseDatabase.getInstance("https://bishnoi-e84fa-default-rtdb.asia-southeast1.firebasedatabase.app").getReference("ads");

        adsReference.addValueEventListener(new ValueEventListener() {
            @Override
            public void onDataChange(@NonNull DataSnapshot snapshot) {
                shabadwaniIAd = (Boolean) snapshot.child("shabadwaniIAd").getValue();
                shabadwaniNAd = (Boolean) snapshot.child("shabadwaniNAd").getValue();

                if (Boolean.TRUE.equals(shabadwaniNAd)) {
                    loadNativeAd();
                }
                if (Boolean.TRUE.equals(shabadwaniIAd)) {
                    loadInterstitialAd();
                }
            }

            @Override
            public void onCancelled(@NonNull DatabaseError error) {

            }
        });
    }

    private void loadNativeAd() {
        AdLoader adLoader = new AdLoader.Builder(this, getResources().getString(R.string.admob_native_ad_id))
                .forNativeAd(new NativeAd.OnNativeAdLoadedListener() {
                    @Override
                    public void onNativeAdLoaded(NativeAd nativeAd) {
                        NativeTemplateStyle styles = new
                                NativeTemplateStyle.Builder().build();
                        TemplateView template = findViewById(R.id.nativeTemplateView);
                        template.setStyles(styles);
                        template.setNativeAd(nativeAd);
                        template.setVisibility(View.VISIBLE);
                    }
                })
                .build();

        adLoader.loadAd(new AdRequest.Builder().build());

    }


    private void showInitialInterstitialAd() {
        if (mInterstitialAd != null) {
            mInterstitialAd.show(Shabadwani.this);
            mInterstitialAd.setFullScreenContentCallback(new FullScreenContentCallback() {
                @Override
                public void onAdDismissedFullScreenContent() {
                    super.onAdDismissedFullScreenContent();
                    mInterstitialAd = null;
                    loadInterstitialAd();
                    showInterstitialAd();
                }

                @Override
                public void onAdFailedToShowFullScreenContent(@NonNull AdError adError) {
                    super.onAdFailedToShowFullScreenContent(adError);
                    mInterstitialAd = null;
                    loadInterstitialAd();
                    showInterstitialAd();

                }
            });
        } else {
            showInterstitialAd();
        }
    }

    private void loadInterstitialAd() {
        AdRequest adRequest = new AdRequest.Builder().build();

        InterstitialAd.load(this, getResources().getString(R.string.admob_interstitial_ad_id), adRequest,
                new InterstitialAdLoadCallback() {
                    @Override
                    public void onAdLoaded(@NonNull InterstitialAd interstitialAd) {
                        // The mInterstitialAd reference will be null until
                        // an ad is loaded.
                        mInterstitialAd = interstitialAd;
                        Log.i(TAG, "onAdLoaded");
                    }

                    @Override
                    public void onAdFailedToLoad(@NonNull LoadAdError loadAdError) {
                        // Handle the error
                        Log.d(TAG, loadAdError.toString());
                        mInterstitialAd = null;
                    }
                });
    }

    private void showInterstitialAd() {
        new Handler().postDelayed(new Runnable() {
            @Override
            public void run() {
                runOnUiThread(new Runnable() {
                    @Override
                    public void run() {

                        if (isActive) {
                            if (mInterstitialAd != null) {
                                mInterstitialAd.show(Shabadwani.this);
                                mInterstitialAd.setFullScreenContentCallback(new FullScreenContentCallback() {
                                    @Override
                                    public void onAdDismissedFullScreenContent() {
                                        super.onAdDismissedFullScreenContent();
                                        mInterstitialAd = null;
                                        loadInterstitialAd();
                                        showInterstitialAd();
                                    }

                                    @Override
                                    public void onAdFailedToShowFullScreenContent(@NonNull AdError adError) {
                                        super.onAdFailedToShowFullScreenContent(adError);
                                        mInterstitialAd = null;
                                        loadInterstitialAd();
                                        showInterstitialAd();

                                    }
                                });
                            } else {
                                showInterstitialAd();
                            }
                        }
                    }
                });
            }
        }, 40*1000);
    }


    private void set_shabadAdapter() {
        shabadAdapter = new ShabadAdapter(shabads, shabadDescription, this);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        recyclerView.setAdapter(shabadAdapter);
    }

    @SuppressLint("ClickableViewAccessibility")
    @Override
    public void onItemClick(int position) {
        int[] currentPosition = {position};
        layout_recycler.setVisibility(View.GONE);
        layout_description.setVisibility(View.VISIBLE);
        btnList.setVisibility(View.VISIBLE);
        setShabads(currentPosition[0]);

        arrow_forward.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                animateScaleView(arrow_forward);
                if (currentPosition[0] >= 0 && currentPosition[0] < 119) {
                    currentPosition[0] = currentPosition[0] + 1;
                    setShabads(currentPosition[0]);
                }
            }
        });

        arrow_back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                animateScaleView(arrow_back);
                if (currentPosition[0] > 0 && currentPosition[0] < 120) {
                    currentPosition[0] = currentPosition[0] - 1;
                    setShabads(currentPosition[0]);
                }
            }
        });

        home.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                animateFadeView(home);
                layout_recycler.setVisibility(View.VISIBLE);
                layout_description.setVisibility(View.GONE);
            }
        });

        OnSwipeTouchListener onSwipeTouchListener = new OnSwipeTouchListener(this, layout_shabad_description) {
            @Override
            public void onSwipeRight(View view) {
                if (currentPosition[0] > 0 && currentPosition[0] < 120) {
                    currentPosition[0] = currentPosition[0] - 1;
                    setShabads(currentPosition[0]);
                }
            }

            @Override
            public void onSwipeLeft(View view) {
                if (currentPosition[0] >= 0 && currentPosition[0] < 119) {
                    currentPosition[0] = currentPosition[0] + 1;
                    setShabads(currentPosition[0]);
                }
            }
        };
        layout_shabad_description.setOnTouchListener(onSwipeTouchListener);

        OnSwipeTouchListener onSwipeTouchListenerScroll = new OnSwipeTouchListener(this, scrollView) {
            @Override
            public void onSwipeRight(View view) {
                if (currentPosition[0] > 0 && currentPosition[0] < 120) {
                    currentPosition[0] = currentPosition[0] - 1;
                    setShabads(currentPosition[0]);
                }
            }

            @Override
            public void onSwipeLeft(View view) {
                if (currentPosition[0] >= 0 && currentPosition[0] < 119) {
                    currentPosition[0] = currentPosition[0] + 1;
                    setShabads(currentPosition[0]);
                }
            }
        };
        scrollView.setOnTouchListener(onSwipeTouchListenerScroll);


    }

    private void setShabads(int position) {
        if (position >= 0 && position < 120) {
            textShabadDescription.setText(shabadDescription[position]);
            titleView.setText(shabads[position]);
        }
    }

    public void setListBtnClick() {
        if (layout_recycler.getVisibility() != View.VISIBLE) {
            layout_recycler.setVisibility(View.VISIBLE);
            layout_description.setVisibility(View.GONE);
            titleView.setText(" शब्दवाणी ");
        }
    }

    private void initViews() {
        recyclerView = findViewById(R.id.recyclerView);

        arrow_back = findViewById(R.id.arrow_back);
        arrow_forward = findViewById(R.id.arrow_forward);
        textShabadDescription = findViewById(R.id.shabadDescriptionView);
        home = findViewById(R.id.home);

        layout_description = findViewById(R.id.layout_shabadDescriptionView);
        layout_recycler = findViewById(R.id.layout_recyclerView);
        layout_shabad_description = findViewById(R.id.layout_shabadDescription);
        scrollView = findViewById(R.id.scroll_view);

        layout_description.setVisibility(View.GONE);
        layout_recycler.setVisibility(View.VISIBLE);

        titleView = findViewById(R.id.titleView);
        btnList = findViewById(R.id.list_btn);
        btnBack = findViewById(R.id.btn_back);

        btnBack.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                animateScaleView(btnBack);
                Intent intent = new Intent(Shabadwani.this, MainActivity.class);
                startActivity(intent);
                finish();
            }
        });

        btnList.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                setListBtnClick();
            }
        });
    }

    private void setWindow() {
        Window window = getWindow();

        window.addFlags(WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS);
        window.setStatusBarColor(ContextCompat.getColor(this, R.color.saffron));
        window.setNavigationBarColor(ContextCompat.getColor(this, R.color.shabadwani_bg));

        View decorView = window.getDecorView();
        int flags = decorView.getSystemUiVisibility();

        flags |= View.SYSTEM_UI_FLAG_LIGHT_STATUS_BAR;
        decorView.setSystemUiVisibility(flags);
    }

    private void animateFadeView(View view) {
        // Load the scale animations
        Animation fadeInAnimation = AnimationUtils.loadAnimation(this, R.anim.fade_in);
        Animation fadeOutAnimation = AnimationUtils.loadAnimation(this, R.anim.fade_out);

        // Apply the animations to the View
        view.startAnimation(fadeInAnimation);
        view.startAnimation(fadeOutAnimation);
    }

    private void animateScaleView(View view) {
        // Load the scale animations
        Animation scaleUpAnimation = AnimationUtils.loadAnimation(this, R.anim.scale_up);
        Animation scaleDownAnimation = AnimationUtils.loadAnimation(this, R.anim.scale_down);

        // Apply the animations to the View
        view.startAnimation(scaleUpAnimation);
        view.startAnimation(scaleDownAnimation);
    }

    @Override
    public void onBackPressed() {
        if (layout_description.getVisibility() == View.VISIBLE) {
            layout_recycler.setVisibility(View.VISIBLE);
            layout_description.setVisibility(View.GONE);
        } else {
            Intent intent = new Intent(this, MainActivity.class);
            startActivity(intent);
            finish();
        }
    }


}