package com.bss.bishnoi;

import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;

import android.os.Bundle;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.TextView;

public class TermsConditions extends AppCompatActivity {

    TextView tvTerms;
    ImageView btnBack;

    private String terms =
            "कृपया बिश्नोई ऐप (इसके बाद से \"ऐप\" के रूप में उल्लिखित) का उपयोग करने से पहले इन शर्तों और नियमों को ध्यान से पढ़ें। ऐप का उपयोग करके, आप इन शर्तों और नियमों से बंधे होते हैं। यदि आप इन शर्तों और नियमों से सहमत नहीं हैं, तो कृपया ऐप का उपयोग न करें।\n" +
            "\n" +
            "1. ऐप का उद्देश्य:\n" +
            "बिश्नोई ऐप का उद्देश्य बिश्नोई समुदाय और उसके सांस्कृतिक धरोहर से संबंधित जानकारी, संसाधन और सेवाएं प्रदान करना है। ऐप के माध्यम से प्रदान की जाने वाली सामग्री और सेवाएं केवल सूचनात्मक उद्देश्यों के लिए हैं और इसे पेशेवर सलाह के रूप में नहीं देखा जाना चाहिए।\n" +
            "\n" +
            "2. उपयोगकर्ता योग्यता:\n" +
            "आपको ऐप का उपयोग करने के लिए कम से कम 13 वर्ष पूर्ण होना चाहिए। यदि आप 13 वर्ष से कम आयु के हैं, तो आपको ऐप का उपयोग करने की अनुमति केवल आपके कानूनी प्रतिनिधि के विवेक से है। ऐप का उपयोग करके, आप विधि अनुसार वयस्क होने और इस समझौते में प्रवेश करने का अधिकार रखते हैं।\n" +
            "\n" +
            "3. खाता बनाना:\n" +
            "ऐप के कुछ विशेषताओं तक पहुंच के लिए आपको खाता बनाने की आवश्यकता हो सकती है। आप अपनी खाता सूचना का गोपनीयता कायम रखने के लिए जिम्मेदार हैं और अपने खाते के तहत होने वाली सभी गतिविधियों के लिए उत्तरदायी हैं। आप नोंचने के दौरान सटीक और अद्यतित जानकारी प्रदान करने के लिए सहमत होते हैं।\n" +
            "\n" +
            "4. वर्जित गतिविधियाँ:\n" +
            "ऐप का उपयोग करते समय, आप निम्नलिखित गतिविधियों में संलग्न नहीं होने के लिए सहमत होते हैं:\n" +
            "अ) लागू सभी प्रासंगिक कानून या विधियाँ उल्लंघन करना।\n" +
            "ब) हानिकारक, आपत्तिजनक या दूसरों के अधिकारों को उल्लंघन करने वाली किसी भी सामग्री को अपलोड, पोस्ट या ट्रांसमिट करना।\n" +
            "क) ऐप या संबंधित सर्वरों को अनधिकृत पहुंच प्राप्त करने का प्रयास करना।\n" +
            "द) पूर्व लिखित परमिशन के बिना व्यावसायिक उद्देश्यो\n" +
            "\n" +
            "ं के लिए ऐप का उपयोग करना।\n" +
            "ध) ऐप की सुरक्षा संबंधी सुविधाओं को आवेगवश अवरुद्ध, अक्षम या बाधित करना।\n" +
            "\n" +
            "5. बुद्धिमत्ता संपदा:\n" +
            "ऐप के माध्यम से उपलब्ध सभी सामग्री, सामग्री और बुद्धिमत्ता संपदा बिश्नोई ऐप या इसके लाइसेंसधारकों की संपत्ति हैं। आप सहमत होते हैं कि विषयसूचक या ट्रेडमार्क संबंधी सामग्री की कोई भी प्रतिलिपि, वितरण या संशोधन बिना मालिक की व्यक्तिगत लिखित सहमति के किये नहीं किया जा सकता है।\n" +
            "\n" +
            "6. गोपनीयता नीति:\n" +
            "आपकी व्यक्तिगत जानकारी का उपयोग हमारे गोपनीयता नीति द्वारा नियंत्रित होता है। ऐप का उपयोग करके, आप गोपनीयता नीति में वर्णित रूप से अपनी जानकारी के संग्रह, प्रसंस्करण और संग्रहण से सहमति देते हैं।\n" +
            "\n" +
            "7. वारंटी का अस्वीकरण:\n" +
            "ऐप \"जैसा है\" और \"जैसा उपलब्ध है\" आधार पर प्रदान किया जाता है बिना किसी भी प्रकार की वारंटी के। बिश्नोई ऐप नहीं गारंटी करता है कि ऐप के माध्यम से प्रदान की जाने वाली किसी भी सामग्री या सेवा की सटीकता, विश्वसनीयता या पूर्णता होगी।\n" +
            "\n" +
            "8. हानि की सीमा:\n" +
            "किसी भी स्थिति में, बिश्नोई ऐप या इसके संबद्ध नहीं जिम्मेदार होंगे जो सीधा, परिवर्तनात्मक, संयुक्त, द्विरूपी या दंडात्मक क्षति से संबंधित होती है।\n" +
            "\n" +
            "9. संशोधन और समाप्ति:\n" +
            "बिश्नोई ऐप को पूर्वानुमान दिये बिना कभी भी संशोधित या बंद करने का अधिकार सुरक्षित रखता है। इसके अलावा, बिश्नोई ऐप आपके ऐप उपयोग के लिए किसी भी कारण से आपके पहुंच को निलंबित या समाप्त कर सकता है, जिसमें इन शर्तों और नियमों का उल्लंघन शामिल हो सकता है।\n" +
            "\n" +
            "10. शासन कानून:\n" +
            "इन शर्तों और नियमों को भारतीय कानून द्वारा विधायित और व्याख्यान किया जाएगा, जिसमें कोई भी विधिक विवाद नहीं होगा।\n" +
            "\n" +
            "11. अखंडता:\n" +
            "यदि इन शर्तों और नियमों के किसी भी प्रावधान को अमान्य या प्रयोज्य माना जाता है, तो शेष प्रावधान पूरी तरह से" +
            " प्रभावशाली रहेंगे।\n" +
            "\n" +
            "12. पूरा समझौता:\n" +
            "बिश्नोई ऐप का उपयोग करके, आप स्वीकार करते हैं कि आपने इन शर्तों को पढ़ा, समझा और स्वीकार किया है। यदि आप इन शर्तों के किसी भाग से असहमत हैं, तो कृपया ऐप का उपयोग न करें। \n";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_terms_conditions);

        setWindow();
        initViews();
    }

    private void initViews() {
        tvTerms = findViewById(R.id.text_terms);
        btnBack = findViewById(R.id.btn_back);

        tvTerms.setText(terms);

        btnBack.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                TermsConditions.super.onBackPressed();
            }
        });
    }

    private void setWindow() {
        Window window = getWindow();

        window.addFlags(WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS);
        window.setStatusBarColor(ContextCompat.getColor(this, R.color.saffron));
//        window.setNavigationBarColor(ContextCompat.getColor(this, R.color.white));

        View decorView = window.getDecorView();
        int flags = decorView.getSystemUiVisibility();

        flags |= View.SYSTEM_UI_FLAG_LIGHT_STATUS_BAR;
        decorView.setSystemUiVisibility(flags);
    }
}